Contents of the .debug_aranges section:

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x0
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000401b06 0000000000001678 
    0000000000000000 0000000000000000 

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x27f9 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x4b259): GNU C11 5.4.0 20160609 -mtune=generic -march=x86-64 -g3 -fstack-protector-strong
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x113c3): gemalloc.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x1be07): /home/gedu/labs/gemalloc
    <19>   DW_AT_low_pc      : 0x401b06
    <21>   DW_AT_high_pc     : 0x1678
    <29>   DW_AT_stmt_list   : 0x0
    <2d>   DW_AT_GNU_macros  : 0x0
 <1><31>: Abbrev Number: 2 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 8
    <33>   DW_AT_encoding    : 5	(signed)
    <34>   DW_AT_name        : (indirect string, offset: 0x38734): long int
 <1><38>: Abbrev Number: 3 (DW_TAG_typedef)
    <39>   DW_AT_name        : (indirect string, offset: 0x1010b): size_t
    <3d>   DW_AT_decl_file   : 2
    <3e>   DW_AT_decl_line   : 216
    <3f>   DW_AT_type        : <0x43>
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)

    <79>   DW_AT_name        : (indirect string, offset: 0x266bd): gint16
    <7d>   DW_AT_decl_file   : 3
    <7e>   DW_AT_decl_line   : 39
    <7f>   DW_AT_type        : <0x83>
 <1><83>: Abbrev Number: 2 (DW_TAG_base_type)
    <84>   DW_AT_byte_size   : 2
    <85>   DW_AT_encoding    : 5	(signed)
    <86>   DW_AT_name        : (indirect string, offset: 0x4abc8): short int
 <1><8a>: Abbrev Number: 3 (DW_TAG_typedef)
    <8b>   DW_AT_name        : (indirect string, offset: 0x37dae): guint16
    <8f>   DW_AT_decl_file   : 3
    <90>   DW_AT_decl_line   : 40
    <91>   DW_AT_type        : <0x95>
 <1><95>: Abbrev Number: 2 (DW_TAG_base_type)
    <96>   DW_AT_byte_size   : 2
    <97>   DW_AT_encoding    : 7	(unsigned)
    <98>   DW_AT_name        : (indirect string, offset: 0x2fc54): short unsigned int
 <1><9c>: Abbrev Number: 3 (DW_TAG_typedef)
    <9d>   DW_AT_name        : (indirect string, offset: 0x388e2): guint32
    <a1>   DW_AT_decl_file   : 3
    <a2>   DW_AT_decl_line   : 45
    <a3>   DW_AT_type        : <0xa7>
 <1><a7>: Abbrev Number: 2 (DW_TAG_base_type)
    <a8>   DW_AT_byte_size   : 4
    <a9>   DW_AT_encoding    : 7	(unsigned)
    <aa>   DW_AT_name        : (indirect string, offset: 0x20566): unsigned int
 <1><ae>: Abbrev Number: 3 (DW_TAG_typedef)
    <af>   DW_AT_name        : (indirect string, offset: 0x4853): gsize
    <b3>   DW_AT_decl_file   : 3
    <b4>   DW_AT_decl_line   : 66
    <b5>   DW_AT_type        : <0x43>
 <1><b9>: Abbrev Number: 3 (DW_TAG_typedef)
    <ba>   DW_AT_name        : (indirect string, offset: 0x4bea4): __off_t
    <be>   DW_AT_decl_file   : 4
    <bf>   DW_AT_decl_line   : 131
    <c0>   DW_AT_type        : <0x31>
 <1><c4>: Abbrev Number: 3 (DW_TAG_typedef)
    <c5>   DW_AT_name        : (indirect string, offset: 0x4b2f): __off64_t
    <c9>   DW_AT_decl_file   : 4
    <ca>   DW_AT_decl_line   : 132
    <cb>   DW_AT_type        : <0x31>
 <1><cf>: Abbrev Number: 2 (DW_TAG_base_type)
    <d0>   DW_AT_byte_size   : 8
    <d1>   DW_AT_encoding    : 7	(unsigned)
    <d2>   DW_AT_name        : (indirect string, offset: 0x408c8): sizetype
 <1><d6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d7>   DW_AT_byte_size   : 8
 <1><d8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d9>   DW_AT_byte_size   : 8
    <da>   DW_AT_type        : <0xde>
 <1><de>: Abbrev Number: 2 (DW_TAG_base_type)
    <df>   DW_AT_byte_size   : 1
    <e0>   DW_AT_encoding    : 6	(signed char)
    <e1>   DW_AT_name        : (indirect string, offset: 0x46b6c): char
 <1><e5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e6>   DW_AT_byte_size   : 8
    <e7>   DW_AT_type        : <0xeb>
 <1><eb>: Abbrev Number: 7 (DW_TAG_const_type)
    <ec>   DW_AT_type        : <0xde>
 <1><f0>: Abbrev Number: 3 (DW_TAG_typedef)
    <f1>   DW_AT_name        : (indirect string, offset: 0x5476b): gchar
    <f5>   DW_AT_decl_file   : 5
    <f6>   DW_AT_decl_line   : 46
    <f7>   DW_AT_type        : <0xde>
 <1><fb>: Abbrev Number: 3 (DW_TAG_typedef)
    <fc>   DW_AT_name        : (indirect string, offset: 0x12932): gint
    <100>   DW_AT_decl_file   : 5
    <101>   DW_AT_decl_line   : 49
    <102>   DW_AT_type        : <0x4a>
 <1><106>: Abbrev Number: 3 (DW_TAG_typedef)
    <107>   DW_AT_name        : (indirect string, offset: 0x6f73): gboolean
    <10b>   DW_AT_decl_file   : 5
    <10c>   DW_AT_decl_line   : 50
    <10d>   DW_AT_type        : <0xfb>
 <1><111>: Abbrev Number: 3 (DW_TAG_typedef)
    <112>   DW_AT_name        : (indirect string, offset: 0x43fcd): guint
    <116>   DW_AT_decl_file   : 5
    <117>   DW_AT_decl_line   : 55
    <118>   DW_AT_type        : <0xa7>
 <1><11c>: Abbrev Number: 3 (DW_TAG_typedef)
    <11d>   DW_AT_name        : (indirect string, offset: 0x5467): gfloat
    <121>   DW_AT_decl_file   : 5
    <122>   DW_AT_decl_line   : 57
    <123>   DW_AT_type        : <0x127>
 <1><127>: Abbrev Number: 2 (DW_TAG_base_type)
    <128>   DW_AT_byte_size   : 4
    <129>   DW_AT_encoding    : 4	(float)
    <12a>   DW_AT_name        : (indirect string, offset: 0x5468): float
 <1><12e>: Abbrev Number: 3 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x111d4): gdouble
    <133>   DW_AT_decl_file   : 5
    <134>   DW_AT_decl_line   : 58
    <135>   DW_AT_type        : <0x139>
 <1><139>: Abbrev Number: 2 (DW_TAG_base_type)
    <13a>   DW_AT_byte_size   : 8
    <13b>   DW_AT_encoding    : 4	(float)
    <13c>   DW_AT_name        : (indirect string, offset: 0x4246c): double
 <1><140>: Abbrev Number: 3 (DW_TAG_typedef)
    <141>   DW_AT_name        : (indirect string, offset: 0x11a38): gpointer
    <145>   DW_AT_decl_file   : 5
    <146>   DW_AT_decl_line   : 77
    <147>   DW_AT_type        : <0xd6>
 <1><14b>: Abbrev Number: 3 (DW_TAG_typedef)
    <14c>   DW_AT_name        : (indirect string, offset: 0x52f45): gconstpointer
    <150>   DW_AT_decl_file   : 5
    <151>   DW_AT_decl_line   : 78
    <152>   DW_AT_type        : <0x156>
 <1><156>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <157>   DW_AT_byte_size   : 8
    <158>   DW_AT_type        : <0x15c>
 <1><15c>: Abbrev Number: 8 (DW_TAG_const_type)
 <1><15d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <15e>   DW_AT_byte_size   : 8
    <15f>   DW_AT_type        : <0x163>
 <1><163>: Abbrev Number: 7 (DW_TAG_const_type)
    <164>   DW_AT_type        : <0xf0>
 <1><168>: Abbrev Number: 3 (DW_TAG_typedef)
    <169>   DW_AT_name        : (indirect string, offset: 0x3260f): GArray
    <16d>   DW_AT_decl_file   : 6
    <16e>   DW_AT_decl_line   : 37
    <16f>   DW_AT_type        : <0x173>
 <1><173>: Abbrev Number: 9 (DW_TAG_structure_type)
    <174>   DW_AT_name        : (indirect string, offset: 0x3260e): _GArray
    <178>   DW_AT_byte_size   : 16
    <179>   DW_AT_decl_file   : 6
    <17a>   DW_AT_decl_line   : 41
    <17b>   DW_AT_sibling     : <0x198>
 <2><17f>: Abbrev Number: 10 (DW_TAG_member)
    <180>   DW_AT_name        : (indirect string, offset: 0x1f819): data
    <184>   DW_AT_decl_file   : 6
    <185>   DW_AT_decl_line   : 43
    <186>   DW_AT_type        : <0x198>
    <18a>   DW_AT_data_member_location: 0
 <2><18b>: Abbrev Number: 11 (DW_TAG_member)
    <18c>   DW_AT_name        : len
    <190>   DW_AT_decl_file   : 6
    <191>   DW_AT_decl_line   : 44
    <192>   DW_AT_type        : <0x111>
    <196>   DW_AT_data_member_location: 8
 <2><197>: Abbrev Number: 0
 <1><198>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <199>   DW_AT_byte_size   : 8
    <19a>   DW_AT_type        : <0xf0>
 <1><19e>: Abbrev Number: 12 (DW_TAG_typedef)
    <19f>   DW_AT_name        : (indirect string, offset: 0x2c030): __gnuc_va_list
    <1a3>   DW_AT_decl_file   : 7
    <1a4>   DW_AT_decl_line   : 40
 <1><1a5>: Abbrev Number: 3 (DW_TAG_typedef)
    <1a6>   DW_AT_name        : (indirect string, offset: 0x1fd07): va_list
    <1aa>   DW_AT_decl_file   : 7
    <1ab>   DW_AT_decl_line   : 98
    <1ac>   DW_AT_type        : <0x19e>
 <1><1b0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1b1>   DW_AT_byte_size   : 8
    <1b2>   DW_AT_type        : <0x1b6>
 <1><1b6>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <1b7>   DW_AT_prototyped  : 1
 <1><1b7>: Abbrev Number: 3 (DW_TAG_typedef)
    <1b8>   DW_AT_name        : (indirect string, offset: 0xd75): GMutex
    <1bc>   DW_AT_decl_file   : 8
    <1bd>   DW_AT_decl_line   : 51
    <1be>   DW_AT_type        : <0x1c2>
 <1><1c2>: Abbrev Number: 14 (DW_TAG_union_type)
    <1c3>   DW_AT_name        : (indirect string, offset: 0xd74): _GMutex
    <1c7>   DW_AT_byte_size   : 8
    <1c8>   DW_AT_decl_file   : 8
    <1c9>   DW_AT_decl_line   : 58
    <1ca>   DW_AT_sibling     : <0x1e1>
 <2><1ce>: Abbrev Number: 15 (DW_TAG_member)
    <1cf>   DW_AT_name        : p
    <1d1>   DW_AT_decl_file   : 8
    <1d2>   DW_AT_decl_line   : 61
    <1d3>   DW_AT_type        : <0x140>
 <2><1d7>: Abbrev Number: 15 (DW_TAG_member)
    <1d8>   DW_AT_name        : i
    <1da>   DW_AT_decl_file   : 8
    <1db>   DW_AT_decl_line   : 62
    <1dc>   DW_AT_type        : <0x1e1>
 <2><1e0>: Abbrev Number: 0
 <1><1e1>: Abbrev Number: 16 (DW_TAG_array_type)
    <1e2>   DW_AT_type        : <0x111>
    <1e6>   DW_AT_sibling     : <0x1f1>
 <2><1ea>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <1eb>   DW_AT_type        : <0xcf>
    <1ef>   DW_AT_upper_bound : 1
 <2><1f0>: Abbrev Number: 0
 <1><1f1>: Abbrev Number: 2 (DW_TAG_base_type)
    <1f2>   DW_AT_byte_size   : 8
    <1f3>   DW_AT_encoding    : 7	(unsigned)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x47a71): long long unsigned int
 <1><1f8>: Abbrev Number: 3 (DW_TAG_typedef)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x58166): pthread_t
    <1fd>   DW_AT_decl_file   : 9
    <1fe>   DW_AT_decl_line   : 60
    <1ff>   DW_AT_type        : <0x43>
 <1><203>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <204>   DW_AT_type        : <0x4a>
 <1><208>: Abbrev Number: 3 (DW_TAG_typedef)
    <209>   DW_AT_name        : (indirect string, offset: 0x3fc99): GData
    <20d>   DW_AT_decl_file   : 10
    <20e>   DW_AT_decl_line   : 36
    <20f>   DW_AT_type        : <0x213>
 <1><213>: Abbrev Number: 19 (DW_TAG_structure_type)
    <214>   DW_AT_name        : (indirect string, offset: 0x3fc98): _GData
    <218>   DW_AT_declaration : 1
 <1><218>: Abbrev Number: 16 (DW_TAG_array_type)
    <219>   DW_AT_type        : <0xde>
    <21d>   DW_AT_sibling     : <0x228>
 <2><221>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <222>   DW_AT_type        : <0xcf>
    <226>   DW_AT_upper_bound : 255
 <2><227>: Abbrev Number: 0
 <1><228>: Abbrev Number: 3 (DW_TAG_typedef)
    <229>   DW_AT_name        : (indirect string, offset: 0x4662d): GList
    <22d>   DW_AT_decl_file   : 11
    <22e>   DW_AT_decl_line   : 37
    <22f>   DW_AT_type        : <0x233>
 <1><233>: Abbrev Number: 9 (DW_TAG_structure_type)
    <234>   DW_AT_name        : (indirect string, offset: 0x4662c): _GList
    <238>   DW_AT_byte_size   : 24
    <239>   DW_AT_decl_file   : 11
    <23a>   DW_AT_decl_line   : 39
    <23b>   DW_AT_sibling     : <0x264>
 <2><23f>: Abbrev Number: 10 (DW_TAG_member)
    <240>   DW_AT_name        : (indirect string, offset: 0x1f819): data
    <244>   DW_AT_decl_file   : 11
    <245>   DW_AT_decl_line   : 41
    <246>   DW_AT_type        : <0x140>
    <24a>   DW_AT_data_member_location: 0
 <2><24b>: Abbrev Number: 10 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0x56411): next
    <250>   DW_AT_decl_file   : 11
    <251>   DW_AT_decl_line   : 42
    <252>   DW_AT_type        : <0x264>
    <256>   DW_AT_data_member_location: 8
 <2><257>: Abbrev Number: 10 (DW_TAG_member)
    <258>   DW_AT_name        : (indirect string, offset: 0x51539): prev
    <25c>   DW_AT_decl_file   : 11
    <25d>   DW_AT_decl_line   : 43
    <25e>   DW_AT_type        : <0x264>
    <262>   DW_AT_data_member_location: 16
 <2><263>: Abbrev Number: 0
 <1><264>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <265>   DW_AT_byte_size   : 8
    <266>   DW_AT_type        : <0x228>
 <1><26a>: Abbrev Number: 3 (DW_TAG_typedef)
    <26b>   DW_AT_name        : (indirect string, offset: 0x1133a): GSList
    <26f>   DW_AT_decl_file   : 12
    <270>   DW_AT_decl_line   : 37
    <271>   DW_AT_type        : <0x275>
 <1><275>: Abbrev Number: 9 (DW_TAG_structure_type)
    <276>   DW_AT_name        : (indirect string, offset: 0x11339): _GSList
    <27a>   DW_AT_byte_size   : 16
    <27b>   DW_AT_decl_file   : 12
    <27c>   DW_AT_decl_line   : 39
    <27d>   DW_AT_sibling     : <0x29a>
 <2><281>: Abbrev Number: 10 (DW_TAG_member)
    <282>   DW_AT_name        : (indirect string, offset: 0x1f819): data
    <286>   DW_AT_decl_file   : 12
    <287>   DW_AT_decl_line   : 41
    <288>   DW_AT_type        : <0x140>
    <28c>   DW_AT_data_member_location: 0
 <2><28d>: Abbrev Number: 10 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0x56411): next
    <292>   DW_AT_decl_file   : 12
    <293>   DW_AT_decl_line   : 42
    <294>   DW_AT_type        : <0x29a>
    <298>   DW_AT_data_member_location: 8
 <2><299>: Abbrev Number: 0
 <1><29a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <29b>   DW_AT_byte_size   : 8
    <29c>   DW_AT_type        : <0x26a>
 <1><2a0>: Abbrev Number: 3 (DW_TAG_typedef)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x5702b): gunichar
    <2a5>   DW_AT_decl_file   : 13
    <2a6>   DW_AT_decl_line   : 60
    <2a7>   DW_AT_type        : <0x9c>
 <1><2ab>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <2ac>   DW_AT_byte_size   : 4
    <2ad>   DW_AT_type        : <0xa7>
    <2b1>   DW_AT_decl_file   : 15
    <2b2>   DW_AT_decl_line   : 76
    <2b3>   DW_AT_sibling     : <0x357>
 <2><2b7>: Abbrev Number: 21 (DW_TAG_enumerator)
    <2b8>   DW_AT_name        : (indirect string, offset: 0x2a01e): G_TOKEN_EOF
    <2bc>   DW_AT_const_value : 0
 <2><2bd>: Abbrev Number: 21 (DW_TAG_enumerator)
    <2be>   DW_AT_name        : (indirect string, offset: 0x363f): G_TOKEN_LEFT_PAREN
    <2c2>   DW_AT_const_value : 40
 <2><2c3>: Abbrev Number: 21 (DW_TAG_enumerator)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x516e5): G_TOKEN_RIGHT_PAREN
    <2c8>   DW_AT_const_value : 41
 <2><2c9>: Abbrev Number: 21 (DW_TAG_enumerator)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x1c771): G_TOKEN_LEFT_CURLY
    <2ce>   DW_AT_const_value : 123
 <2><2cf>: Abbrev Number: 21 (DW_TAG_enumerator)
    <2d0>   DW_AT_name        : (indirect string, offset: 0xcbc7): G_TOKEN_RIGHT_CURLY
    <2d4>   DW_AT_const_value : 125
 <2><2d5>: Abbrev Number: 21 (DW_TAG_enumerator)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x23193): G_TOKEN_LEFT_BRACE
    <2da>   DW_AT_const_value : 91
 <2><2db>: Abbrev Number: 21 (DW_TAG_enumerator)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x13931): G_TOKEN_RIGHT_BRACE
    <2e0>   DW_AT_const_value : 93
 <2><2e1>: Abbrev Number: 21 (DW_TAG_enumerator)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x216d0): G_TOKEN_EQUAL_SIGN
    <2e6>   DW_AT_const_value : 61
 <2><2e7>: Abbrev Number: 21 (DW_TAG_enumerator)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x4abd2): G_TOKEN_COMMA
    <2ec>   DW_AT_const_value : 44
 <2><2ed>: Abbrev Number: 22 (DW_TAG_enumerator)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x19282): G_TOKEN_NONE
    <2f2>   DW_AT_const_value : 256
 <2><2f4>: Abbrev Number: 22 (DW_TAG_enumerator)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x357da): G_TOKEN_ERROR
    <2f9>   DW_AT_const_value : 257
 <2><2fb>: Abbrev Number: 22 (DW_TAG_enumerator)
    <2fc>   DW_AT_name        : (indirect string, offset: 0x1f311): G_TOKEN_CHAR
    <300>   DW_AT_const_value : 258
 <2><302>: Abbrev Number: 22 (DW_TAG_enumerator)
    <303>   DW_AT_name        : (indirect string, offset: 0x3ffa7): G_TOKEN_BINARY
    <307>   DW_AT_const_value : 259
 <2><309>: Abbrev Number: 22 (DW_TAG_enumerator)
    <30a>   DW_AT_name        : (indirect string, offset: 0xff55): G_TOKEN_OCTAL
    <30e>   DW_AT_const_value : 260
 <2><310>: Abbrev Number: 22 (DW_TAG_enumerator)
    <311>   DW_AT_name        : (indirect string, offset: 0x32a65): G_TOKEN_INT
    <315>   DW_AT_const_value : 261
 <2><317>: Abbrev Number: 22 (DW_TAG_enumerator)
    <318>   DW_AT_name        : (indirect string, offset: 0x15b8f): G_TOKEN_HEX
    <31c>   DW_AT_const_value : 262
 <2><31e>: Abbrev Number: 22 (DW_TAG_enumerator)
    <31f>   DW_AT_name        : (indirect string, offset: 0x3fc8a): G_TOKEN_FLOAT
    <323>   DW_AT_const_value : 263
 <2><325>: Abbrev Number: 22 (DW_TAG_enumerator)
    <326>   DW_AT_name        : (indirect string, offset: 0xbff9): G_TOKEN_STRING
    <32a>   DW_AT_const_value : 264
 <2><32c>: Abbrev Number: 22 (DW_TAG_enumerator)
    <32d>   DW_AT_name        : (indirect string, offset: 0x10253): G_TOKEN_SYMBOL
    <331>   DW_AT_const_value : 265
 <2><333>: Abbrev Number: 22 (DW_TAG_enumerator)
    <334>   DW_AT_name        : (indirect string, offset: 0x2bc7): G_TOKEN_IDENTIFIER
    <338>   DW_AT_const_value : 266
 <2><33a>: Abbrev Number: 22 (DW_TAG_enumerator)
    <33b>   DW_AT_name        : (indirect string, offset: 0x4503a): G_TOKEN_IDENTIFIER_NULL
    <33f>   DW_AT_const_value : 267
 <2><341>: Abbrev Number: 22 (DW_TAG_enumerator)
    <342>   DW_AT_name        : (indirect string, offset: 0x285e7): G_TOKEN_COMMENT_SINGLE
    <346>   DW_AT_const_value : 268
 <2><348>: Abbrev Number: 22 (DW_TAG_enumerator)
    <349>   DW_AT_name        : (indirect string, offset: 0x8e2): G_TOKEN_COMMENT_MULTI
    <34d>   DW_AT_const_value : 269
 <2><34f>: Abbrev Number: 22 (DW_TAG_enumerator)
    <350>   DW_AT_name        : (indirect string, offset: 0x44562): G_TOKEN_LAST
    <354>   DW_AT_const_value : 270
 <2><356>: Abbrev Number: 0
 <1><357>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <358>   DW_AT_byte_size   : 8
    <359>   DW_AT_type        : <0x208>
 <1><35d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <35e>   DW_AT_byte_size   : 8
    <35f>   DW_AT_type        : <0x198>
 <1><363>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <364>   DW_AT_byte_size   : 8
    <365>   DW_AT_type        : <0x168>
 <1><369>: Abbrev Number: 23 (DW_TAG_typedef)
    <36a>   DW_AT_name        : (indirect string, offset: 0x2189d): GType
    <36e>   DW_AT_decl_file   : 14
    <36f>   DW_AT_decl_line   : 382
    <371>   DW_AT_type        : <0xae>
 <1><375>: Abbrev Number: 23 (DW_TAG_typedef)
    <376>   DW_AT_name        : (indirect string, offset: 0x36866): GTypeClass
    <37a>   DW_AT_decl_file   : 14
    <37b>   DW_AT_decl_line   : 389
    <37d>   DW_AT_type        : <0x381>
 <1><381>: Abbrev Number: 24 (DW_TAG_structure_type)
    <382>   DW_AT_name        : (indirect string, offset: 0x36865): _GTypeClass
    <386>   DW_AT_byte_size   : 8
    <387>   DW_AT_decl_file   : 14
    <388>   DW_AT_decl_line   : 406
    <38a>   DW_AT_sibling     : <0x39c>
 <2><38e>: Abbrev Number: 25 (DW_TAG_member)
    <38f>   DW_AT_name        : (indirect string, offset: 0x40117): g_type
    <393>   DW_AT_decl_file   : 14
    <394>   DW_AT_decl_line   : 409
    <396>   DW_AT_type        : <0x369>
    <39a>   DW_AT_data_member_location: 0
 <2><39b>: Abbrev Number: 0
 <1><39c>: Abbrev Number: 23 (DW_TAG_typedef)
    <39d>   DW_AT_name        : (indirect string, offset: 0x51e76): GTypeInstance
    <3a1>   DW_AT_decl_file   : 14
    <3a2>   DW_AT_decl_line   : 391
    <3a4>   DW_AT_type        : <0x3a8>
 <1><3a8>: Abbrev Number: 24 (DW_TAG_structure_type)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x51e75): _GTypeInstance
    <3ad>   DW_AT_byte_size   : 8
    <3ae>   DW_AT_decl_file   : 14
    <3af>   DW_AT_decl_line   : 416
    <3b1>   DW_AT_sibling     : <0x3c3>
 <2><3b5>: Abbrev Number: 25 (DW_TAG_member)
    <3b6>   DW_AT_name        : (indirect string, offset: 0x57c82): g_class
    <3ba>   DW_AT_decl_file   : 14
    <3bb>   DW_AT_decl_line   : 419
    <3bd>   DW_AT_type        : <0x3c3>
    <3c1>   DW_AT_data_member_location: 0
 <2><3c2>: Abbrev Number: 0
 <1><3c3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <3c4>   DW_AT_byte_size   : 8
    <3c5>   DW_AT_type        : <0x375>
 <1><3c9>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <3ca>   DW_AT_byte_size   : 4
    <3cb>   DW_AT_type        : <0x4a>
    <3cf>   DW_AT_decl_file   : 16
    <3d0>   DW_AT_decl_line   : 151
    <3d1>   DW_AT_sibling     : <0x425>
 <2><3d5>: Abbrev Number: 21 (DW_TAG_enumerator)
    <3d6>   DW_AT_name        : (indirect string, offset: 0xf653): G_PARAM_READABLE
    <3da>   DW_AT_const_value : 1
 <2><3db>: Abbrev Number: 21 (DW_TAG_enumerator)
    <3dc>   DW_AT_name        : (indirect string, offset: 0x34063): G_PARAM_WRITABLE
    <3e0>   DW_AT_const_value : 2
 <2><3e1>: Abbrev Number: 21 (DW_TAG_enumerator)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x5b4f3): G_PARAM_READWRITE
    <3e6>   DW_AT_const_value : 3
 <2><3e7>: Abbrev Number: 21 (DW_TAG_enumerator)
    <3e8>   DW_AT_name        : (indirect string, offset: 0x2d554): G_PARAM_CONSTRUCT
    <3ec>   DW_AT_const_value : 4
 <2><3ed>: Abbrev Number: 21 (DW_TAG_enumerator)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x4d256): G_PARAM_CONSTRUCT_ONLY
    <3f2>   DW_AT_const_value : 8
 <2><3f3>: Abbrev Number: 21 (DW_TAG_enumerator)
    <3f4>   DW_AT_name        : (indirect string, offset: 0x3b2c8): G_PARAM_LAX_VALIDATION
    <3f8>   DW_AT_const_value : 16
 <2><3f9>: Abbrev Number: 21 (DW_TAG_enumerator)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x343a): G_PARAM_STATIC_NAME
    <3fe>   DW_AT_const_value : 32
 <2><3ff>: Abbrev Number: 21 (DW_TAG_enumerator)
    <400>   DW_AT_name        : (indirect string, offset: 0xfcd1): G_PARAM_PRIVATE
    <404>   DW_AT_const_value : 32
 <2><405>: Abbrev Number: 21 (DW_TAG_enumerator)
    <406>   DW_AT_name        : (indirect string, offset: 0x11d09): G_PARAM_STATIC_NICK
    <40a>   DW_AT_const_value : 64
 <2><40b>: Abbrev Number: 21 (DW_TAG_enumerator)
    <40c>   DW_AT_name        : (indirect string, offset: 0x2a68f): G_PARAM_STATIC_BLURB
    <410>   DW_AT_const_value : 128
 <2><411>: Abbrev Number: 26 (DW_TAG_enumerator)
    <412>   DW_AT_name        : (indirect string, offset: 0xe552): G_PARAM_EXPLICIT_NOTIFY
    <416>   DW_AT_const_value : 0x40000000
 <2><41a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <41b>   DW_AT_name        : (indirect string, offset: 0x15c5): G_PARAM_DEPRECATED
    <41f>   DW_AT_const_value : -2147483648
 <2><424>: Abbrev Number: 0
 <1><425>: Abbrev Number: 3 (DW_TAG_typedef)
    <426>   DW_AT_name        : (indirect string, offset: 0x316ad): GCallback
    <42a>   DW_AT_decl_file   : 17
    <42b>   DW_AT_decl_line   : 86
    <42c>   DW_AT_type        : <0x1b0>
 <1><430>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <431>   DW_AT_type        : <0x111>
 <1><435>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <436>   DW_AT_byte_size   : 4
    <437>   DW_AT_type        : <0xa7>
    <43b>   DW_AT_decl_file   : 18
    <43c>   DW_AT_decl_line   : 128
    <43d>   DW_AT_sibling     : <0x479>
 <2><441>: Abbrev Number: 21 (DW_TAG_enumerator)
    <442>   DW_AT_name        : (indirect string, offset: 0x31a95): G_SIGNAL_RUN_FIRST
    <446>   DW_AT_const_value : 1
 <2><447>: Abbrev Number: 21 (DW_TAG_enumerator)
    <448>   DW_AT_name        : (indirect string, offset: 0x10ca1): G_SIGNAL_RUN_LAST
    <44c>   DW_AT_const_value : 2
 <2><44d>: Abbrev Number: 21 (DW_TAG_enumerator)
    <44e>   DW_AT_name        : (indirect string, offset: 0x3069e): G_SIGNAL_RUN_CLEANUP
    <452>   DW_AT_const_value : 4
 <2><453>: Abbrev Number: 21 (DW_TAG_enumerator)
    <454>   DW_AT_name        : (indirect string, offset: 0x24bbb): G_SIGNAL_NO_RECURSE
    <458>   DW_AT_const_value : 8
 <2><459>: Abbrev Number: 21 (DW_TAG_enumerator)
    <45a>   DW_AT_name        : (indirect string, offset: 0x52afc): G_SIGNAL_DETAILED
    <45e>   DW_AT_const_value : 16
 <2><45f>: Abbrev Number: 21 (DW_TAG_enumerator)
    <460>   DW_AT_name        : (indirect string, offset: 0x370b7): G_SIGNAL_ACTION
    <464>   DW_AT_const_value : 32
 <2><465>: Abbrev Number: 21 (DW_TAG_enumerator)
    <466>   DW_AT_name        : (indirect string, offset: 0x531b1): G_SIGNAL_NO_HOOKS
    <46a>   DW_AT_const_value : 64
 <2><46b>: Abbrev Number: 21 (DW_TAG_enumerator)
    <46c>   DW_AT_name        : (indirect string, offset: 0x2c115): G_SIGNAL_MUST_COLLECT
    <470>   DW_AT_const_value : 128
 <2><471>: Abbrev Number: 22 (DW_TAG_enumerator)
    <472>   DW_AT_name        : (indirect string, offset: 0x47e8c): G_SIGNAL_DEPRECATED
    <476>   DW_AT_const_value : 256
 <2><478>: Abbrev Number: 0
 <1><479>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <47a>   DW_AT_byte_size   : 4
    <47b>   DW_AT_type        : <0xa7>
    <47f>   DW_AT_decl_file   : 18
    <480>   DW_AT_decl_line   : 156
    <481>   DW_AT_sibling     : <0x492>
 <2><485>: Abbrev Number: 21 (DW_TAG_enumerator)
    <486>   DW_AT_name        : (indirect string, offset: 0x21428): G_CONNECT_AFTER
    <48a>   DW_AT_const_value : 1
 <2><48b>: Abbrev Number: 21 (DW_TAG_enumerator)
    <48c>   DW_AT_name        : (indirect string, offset: 0x4c008): G_CONNECT_SWAPPED
    <490>   DW_AT_const_value : 2
 <2><491>: Abbrev Number: 0
 <1><492>: Abbrev Number: 3 (DW_TAG_typedef)
    <493>   DW_AT_name        : (indirect string, offset: 0x3b651): GConnectFlags
    <497>   DW_AT_decl_file   : 18
    <498>   DW_AT_decl_line   : 159
    <499>   DW_AT_type        : <0x479>
 <1><49d>: Abbrev Number: 3 (DW_TAG_typedef)
    <49e>   DW_AT_name        : (indirect string, offset: 0xf422): GObject
    <4a2>   DW_AT_decl_file   : 19
    <4a3>   DW_AT_decl_line   : 187
    <4a4>   DW_AT_type        : <0x4a8>
 <1><4a8>: Abbrev Number: 9 (DW_TAG_structure_type)
    <4a9>   DW_AT_name        : (indirect string, offset: 0xf421): _GObject
    <4ad>   DW_AT_byte_size   : 24
    <4ae>   DW_AT_decl_file   : 19
    <4af>   DW_AT_decl_line   : 245
    <4b0>   DW_AT_sibling     : <0x4d9>
 <2><4b4>: Abbrev Number: 10 (DW_TAG_member)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x19a8c): g_type_instance
    <4b9>   DW_AT_decl_file   : 19
    <4ba>   DW_AT_decl_line   : 247
    <4bb>   DW_AT_type        : <0x39c>
    <4bf>   DW_AT_data_member_location: 0
 <2><4c0>: Abbrev Number: 10 (DW_TAG_member)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x1e714): ref_count
    <4c5>   DW_AT_decl_file   : 19
    <4c6>   DW_AT_decl_line   : 250
    <4c7>   DW_AT_type        : <0x430>
    <4cb>   DW_AT_data_member_location: 8
 <2><4cc>: Abbrev Number: 10 (DW_TAG_member)
    <4cd>   DW_AT_name        : (indirect string, offset: 0x5240b): qdata
    <4d1>   DW_AT_decl_file   : 19
    <4d2>   DW_AT_decl_line   : 251
    <4d3>   DW_AT_type        : <0x357>
    <4d7>   DW_AT_data_member_location: 16
 <2><4d8>: Abbrev Number: 0
 <1><4d9>: Abbrev Number: 3 (DW_TAG_typedef)
    <4da>   DW_AT_name        : (indirect string, offset: 0x4e68c): GInitiallyUnowned
    <4de>   DW_AT_decl_file   : 19
    <4df>   DW_AT_decl_line   : 189
    <4e0>   DW_AT_type        : <0x4a8>
 <1><4e4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <4e5>   DW_AT_byte_size   : 8
    <4e6>   DW_AT_type        : <0x4a>
 <1><4ea>: Abbrev Number: 23 (DW_TAG_typedef)
    <4eb>   DW_AT_name        : (indirect string, offset: 0xb24a): cairo_font_options_t
    <4ef>   DW_AT_decl_file   : 20
    <4f0>   DW_AT_decl_line   : 1366
    <4f2>   DW_AT_type        : <0x4f6>
 <1><4f6>: Abbrev Number: 19 (DW_TAG_structure_type)
    <4f7>   DW_AT_name        : (indirect string, offset: 0x47283): _cairo_font_options
    <4fb>   DW_AT_declaration : 1
 <1><4fb>: Abbrev Number: 3 (DW_TAG_typedef)
    <4fc>   DW_AT_name        : (indirect string, offset: 0xc357): PangoFontDescription
    <500>   DW_AT_decl_file   : 21
    <501>   DW_AT_decl_line   : 40
    <502>   DW_AT_type        : <0x506>
 <1><506>: Abbrev Number: 19 (DW_TAG_structure_type)
    <507>   DW_AT_name        : (indirect string, offset: 0xc356): _PangoFontDescription
    <50b>   DW_AT_declaration : 1
 <1><50b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <50c>   DW_AT_byte_size   : 8
    <50d>   DW_AT_type        : <0x4fb>
 <1><511>: Abbrev Number: 3 (DW_TAG_typedef)
    <512>   DW_AT_name        : (indirect string, offset: 0x459b5): PangoLayout
    <516>   DW_AT_decl_file   : 22
    <517>   DW_AT_decl_line   : 32
    <518>   DW_AT_type        : <0x51c>
 <1><51c>: Abbrev Number: 19 (DW_TAG_structure_type)
    <51d>   DW_AT_name        : (indirect string, offset: 0x459b4): _PangoLayout
    <521>   DW_AT_declaration : 1
 <1><521>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <522>   DW_AT_byte_size   : 8
    <523>   DW_AT_type        : <0x511>
 <1><527>: Abbrev Number: 9 (DW_TAG_structure_type)
    <528>   DW_AT_name        : (indirect string, offset: 0x4e3c9): _IO_FILE
    <52c>   DW_AT_byte_size   : 216
    <52d>   DW_AT_decl_file   : 23
    <52e>   DW_AT_decl_line   : 241
    <52f>   DW_AT_sibling     : <0x6a4>
 <2><533>: Abbrev Number: 10 (DW_TAG_member)
    <534>   DW_AT_name        : (indirect string, offset: 0x52098): _flags
    <538>   DW_AT_decl_file   : 23
    <539>   DW_AT_decl_line   : 242
    <53a>   DW_AT_type        : <0x4a>
    <53e>   DW_AT_data_member_location: 0
 <2><53f>: Abbrev Number: 10 (DW_TAG_member)
    <540>   DW_AT_name        : (indirect string, offset: 0x51cab): _IO_read_ptr
    <544>   DW_AT_decl_file   : 23
    <545>   DW_AT_decl_line   : 247
    <546>   DW_AT_type        : <0xd8>
    <54a>   DW_AT_data_member_location: 8
 <2><54b>: Abbrev Number: 10 (DW_TAG_member)
    <54c>   DW_AT_name        : (indirect string, offset: 0x4df46): _IO_read_end
    <550>   DW_AT_decl_file   : 23
    <551>   DW_AT_decl_line   : 248
    <552>   DW_AT_type        : <0xd8>
    <556>   DW_AT_data_member_location: 16
 <2><557>: Abbrev Number: 10 (DW_TAG_member)
    <558>   DW_AT_name        : (indirect string, offset: 0x29aed): _IO_read_base
    <55c>   DW_AT_decl_file   : 23
    <55d>   DW_AT_decl_line   : 249
    <55e>   DW_AT_type        : <0xd8>
    <562>   DW_AT_data_member_location: 24
 <2><563>: Abbrev Number: 10 (DW_TAG_member)
    <564>   DW_AT_name        : (indirect string, offset: 0xc59f): _IO_write_base
    <568>   DW_AT_decl_file   : 23
    <569>   DW_AT_decl_line   : 250
    <56a>   DW_AT_type        : <0xd8>
    <56e>   DW_AT_data_member_location: 32
 <2><56f>: Abbrev Number: 10 (DW_TAG_member)
    <570>   DW_AT_name        : (indirect string, offset: 0x28134): _IO_write_ptr
    <574>   DW_AT_decl_file   : 23
    <575>   DW_AT_decl_line   : 251
    <576>   DW_AT_type        : <0xd8>
    <57a>   DW_AT_data_member_location: 40
 <2><57b>: Abbrev Number: 10 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x244d1): _IO_write_end
    <580>   DW_AT_decl_file   : 23
    <581>   DW_AT_decl_line   : 252
    <582>   DW_AT_type        : <0xd8>
    <586>   DW_AT_data_member_location: 48
 <2><587>: Abbrev Number: 10 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0x1cdac): _IO_buf_base
    <58c>   DW_AT_decl_file   : 23
    <58d>   DW_AT_decl_line   : 253
    <58e>   DW_AT_type        : <0xd8>
    <592>   DW_AT_data_member_location: 56
 <2><593>: Abbrev Number: 10 (DW_TAG_member)
    <594>   DW_AT_name        : (indirect string, offset: 0x933): _IO_buf_end
    <598>   DW_AT_decl_file   : 23
    <599>   DW_AT_decl_line   : 254
    <59a>   DW_AT_type        : <0xd8>
    <59e>   DW_AT_data_member_location: 64
 <2><59f>: Abbrev Number: 25 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0x245b8): _IO_save_base
    <5a4>   DW_AT_decl_file   : 23
    <5a5>   DW_AT_decl_line   : 256
    <5a7>   DW_AT_type        : <0xd8>
    <5ab>   DW_AT_data_member_location: 72
 <2><5ac>: Abbrev Number: 25 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x2b2a7): _IO_backup_base
    <5b1>   DW_AT_decl_file   : 23
    <5b2>   DW_AT_decl_line   : 257
    <5b4>   DW_AT_type        : <0xd8>
    <5b8>   DW_AT_data_member_location: 80
 <2><5b9>: Abbrev Number: 25 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x3fd11): _IO_save_end
    <5be>   DW_AT_decl_file   : 23
    <5bf>   DW_AT_decl_line   : 258
    <5c1>   DW_AT_type        : <0xd8>
    <5c5>   DW_AT_data_member_location: 88
 <2><5c6>: Abbrev Number: 25 (DW_TAG_member)
    <5c7>   DW_AT_name        : (indirect string, offset: 0xaeef): _markers
    <5cb>   DW_AT_decl_file   : 23
    <5cc>   DW_AT_decl_line   : 260
    <5ce>   DW_AT_type        : <0x6dc>
    <5d2>   DW_AT_data_member_location: 96
 <2><5d3>: Abbrev Number: 25 (DW_TAG_member)
    <5d4>   DW_AT_name        : (indirect string, offset: 0x3a6b1): _chain
    <5d8>   DW_AT_decl_file   : 23
    <5d9>   DW_AT_decl_line   : 262
    <5db>   DW_AT_type        : <0x6e2>
    <5df>   DW_AT_data_member_location: 104
 <2><5e0>: Abbrev Number: 25 (DW_TAG_member)
    <5e1>   DW_AT_name        : (indirect string, offset: 0x4226e): _fileno
    <5e5>   DW_AT_decl_file   : 23
    <5e6>   DW_AT_decl_line   : 264
    <5e8>   DW_AT_type        : <0x4a>
    <5ec>   DW_AT_data_member_location: 112
 <2><5ed>: Abbrev Number: 25 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x46daa): _flags2
    <5f2>   DW_AT_decl_file   : 23
    <5f3>   DW_AT_decl_line   : 268
    <5f5>   DW_AT_type        : <0x4a>
    <5f9>   DW_AT_data_member_location: 116
 <2><5fa>: Abbrev Number: 25 (DW_TAG_member)
    <5fb>   DW_AT_name        : (indirect string, offset: 0x1af1a): _old_offset
    <5ff>   DW_AT_decl_file   : 23
    <600>   DW_AT_decl_line   : 270
    <602>   DW_AT_type        : <0xb9>
    <606>   DW_AT_data_member_location: 120
 <2><607>: Abbrev Number: 25 (DW_TAG_member)
    <608>   DW_AT_name        : (indirect string, offset: 0x34d21): _cur_column
    <60c>   DW_AT_decl_file   : 23
    <60d>   DW_AT_decl_line   : 274
    <60f>   DW_AT_type        : <0x95>
    <613>   DW_AT_data_member_location: 128
 <2><614>: Abbrev Number: 25 (DW_TAG_member)
    <615>   DW_AT_name        : (indirect string, offset: 0x3dea9): _vtable_offset
    <619>   DW_AT_decl_file   : 23
    <61a>   DW_AT_decl_line   : 275
    <61c>   DW_AT_type        : <0x5f>
    <620>   DW_AT_data_member_location: 130
 <2><621>: Abbrev Number: 25 (DW_TAG_member)
    <622>   DW_AT_name        : (indirect string, offset: 0x378d4): _shortbuf
    <626>   DW_AT_decl_file   : 23
    <627>   DW_AT_decl_line   : 276
    <629>   DW_AT_type        : <0x6e8>
    <62d>   DW_AT_data_member_location: 131
 <2><62e>: Abbrev Number: 25 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0x12575): _lock
    <633>   DW_AT_decl_file   : 23
    <634>   DW_AT_decl_line   : 280
    <636>   DW_AT_type        : <0x6f8>
    <63a>   DW_AT_data_member_location: 136
 <2><63b>: Abbrev Number: 25 (DW_TAG_member)
    <63c>   DW_AT_name        : (indirect string, offset: 0x1af1e): _offset
    <640>   DW_AT_decl_file   : 23
    <641>   DW_AT_decl_line   : 289
    <643>   DW_AT_type        : <0xc4>
    <647>   DW_AT_data_member_location: 144
 <2><648>: Abbrev Number: 25 (DW_TAG_member)
    <649>   DW_AT_name        : (indirect string, offset: 0xb196): __pad1
    <64d>   DW_AT_decl_file   : 23
    <64e>   DW_AT_decl_line   : 297
    <650>   DW_AT_type        : <0xd6>
    <654>   DW_AT_data_member_location: 152
 <2><655>: Abbrev Number: 25 (DW_TAG_member)
    <656>   DW_AT_name        : (indirect string, offset: 0xb19d): __pad2
    <65a>   DW_AT_decl_file   : 23
    <65b>   DW_AT_decl_line   : 298
    <65d>   DW_AT_type        : <0xd6>
    <661>   DW_AT_data_member_location: 160
 <2><662>: Abbrev Number: 25 (DW_TAG_member)
    <663>   DW_AT_name        : (indirect string, offset: 0xb1a4): __pad3
    <667>   DW_AT_decl_file   : 23
    <668>   DW_AT_decl_line   : 299
    <66a>   DW_AT_type        : <0xd6>
    <66e>   DW_AT_data_member_location: 168
 <2><66f>: Abbrev Number: 25 (DW_TAG_member)
    <670>   DW_AT_name        : (indirect string, offset: 0xb1ab): __pad4
    <674>   DW_AT_decl_file   : 23
    <675>   DW_AT_decl_line   : 300
    <677>   DW_AT_type        : <0xd6>
    <67b>   DW_AT_data_member_location: 176
 <2><67c>: Abbrev Number: 25 (DW_TAG_member)
    <67d>   DW_AT_name        : (indirect string, offset: 0xb1b2): __pad5
    <681>   DW_AT_decl_file   : 23
    <682>   DW_AT_decl_line   : 302
    <684>   DW_AT_type        : <0x38>
    <688>   DW_AT_data_member_location: 184
 <2><689>: Abbrev Number: 25 (DW_TAG_member)
    <68a>   DW_AT_name        : (indirect string, offset: 0x2f986): _mode
    <68e>   DW_AT_decl_file   : 23
    <68f>   DW_AT_decl_line   : 303
    <691>   DW_AT_type        : <0x4a>
    <695>   DW_AT_data_member_location: 192
 <2><696>: Abbrev Number: 25 (DW_TAG_member)
    <697>   DW_AT_name        : (indirect string, offset: 0x1fe0a): _unused2
    <69b>   DW_AT_decl_file   : 23
    <69c>   DW_AT_decl_line   : 305
    <69e>   DW_AT_type        : <0x6fe>
    <6a2>   DW_AT_data_member_location: 196
 <2><6a3>: Abbrev Number: 0
 <1><6a4>: Abbrev Number: 12 (DW_TAG_typedef)
    <6a5>   DW_AT_name        : (indirect string, offset: 0x5c09a): _IO_lock_t
    <6a9>   DW_AT_decl_file   : 23
    <6aa>   DW_AT_decl_line   : 150
 <1><6ab>: Abbrev Number: 9 (DW_TAG_structure_type)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x2c0ce): _IO_marker
    <6b0>   DW_AT_byte_size   : 24
    <6b1>   DW_AT_decl_file   : 23
    <6b2>   DW_AT_decl_line   : 156
    <6b3>   DW_AT_sibling     : <0x6dc>
 <2><6b7>: Abbrev Number: 10 (DW_TAG_member)
    <6b8>   DW_AT_name        : (indirect string, offset: 0x56410): _next
    <6bc>   DW_AT_decl_file   : 23
    <6bd>   DW_AT_decl_line   : 157
    <6be>   DW_AT_type        : <0x6dc>
    <6c2>   DW_AT_data_member_location: 0
 <2><6c3>: Abbrev Number: 10 (DW_TAG_member)
    <6c4>   DW_AT_name        : (indirect string, offset: 0x536b0): _sbuf
    <6c8>   DW_AT_decl_file   : 23
    <6c9>   DW_AT_decl_line   : 158
    <6ca>   DW_AT_type        : <0x6e2>
    <6ce>   DW_AT_data_member_location: 8
 <2><6cf>: Abbrev Number: 10 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0x5806): _pos
    <6d4>   DW_AT_decl_file   : 23
    <6d5>   DW_AT_decl_line   : 162
    <6d6>   DW_AT_type        : <0x4a>
    <6da>   DW_AT_data_member_location: 16
 <2><6db>: Abbrev Number: 0
 <1><6dc>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <6dd>   DW_AT_byte_size   : 8
    <6de>   DW_AT_type        : <0x6ab>
 <1><6e2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <6e3>   DW_AT_byte_size   : 8
    <6e4>   DW_AT_type        : <0x527>
 <1><6e8>: Abbrev Number: 16 (DW_TAG_array_type)
    <6e9>   DW_AT_type        : <0xde>
    <6ed>   DW_AT_sibling     : <0x6f8>
 <2><6f1>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <6f2>   DW_AT_type        : <0xcf>
    <6f6>   DW_AT_upper_bound : 0
 <2><6f7>: Abbrev Number: 0
 <1><6f8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <6f9>   DW_AT_byte_size   : 8
    <6fa>   DW_AT_type        : <0x6a4>
 <1><6fe>: Abbrev Number: 16 (DW_TAG_array_type)
    <6ff>   DW_AT_type        : <0xde>
    <703>   DW_AT_sibling     : <0x70e>
 <2><707>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <708>   DW_AT_type        : <0xcf>
    <70c>   DW_AT_upper_bound : 19
 <2><70d>: Abbrev Number: 0
 <1><70e>: Abbrev Number: 3 (DW_TAG_typedef)
    <70f>   DW_AT_name        : (indirect string, offset: 0x2604): GdkRectangle
    <713>   DW_AT_decl_file   : 24
    <714>   DW_AT_decl_line   : 69
    <715>   DW_AT_type        : <0x719>
 <1><719>: Abbrev Number: 9 (DW_TAG_structure_type)
    <71a>   DW_AT_name        : (indirect string, offset: 0x2603): _GdkRectangle
    <71e>   DW_AT_byte_size   : 16
    <71f>   DW_AT_decl_file   : 24
    <720>   DW_AT_decl_line   : 200
    <721>   DW_AT_sibling     : <0x752>
 <2><725>: Abbrev Number: 11 (DW_TAG_member)
    <726>   DW_AT_name        : x
    <728>   DW_AT_decl_file   : 24
    <729>   DW_AT_decl_line   : 202
    <72a>   DW_AT_type        : <0xfb>
    <72e>   DW_AT_data_member_location: 0
 <2><72f>: Abbrev Number: 11 (DW_TAG_member)
    <730>   DW_AT_name        : y
    <732>   DW_AT_decl_file   : 24
    <733>   DW_AT_decl_line   : 203
    <734>   DW_AT_type        : <0xfb>
    <738>   DW_AT_data_member_location: 4
 <2><739>: Abbrev Number: 10 (DW_TAG_member)
    <73a>   DW_AT_name        : (indirect string, offset: 0x40d9f): width
    <73e>   DW_AT_decl_file   : 24
    <73f>   DW_AT_decl_line   : 204
    <740>   DW_AT_type        : <0xfb>
    <744>   DW_AT_data_member_location: 8
 <2><745>: Abbrev Number: 10 (DW_TAG_member)
    <746>   DW_AT_name        : (indirect string, offset: 0x2996): height
    <74a>   DW_AT_decl_file   : 24
    <74b>   DW_AT_decl_line   : 205
    <74c>   DW_AT_type        : <0xfb>
    <750>   DW_AT_data_member_location: 12
 <2><751>: Abbrev Number: 0
 <1><752>: Abbrev Number: 3 (DW_TAG_typedef)
    <753>   DW_AT_name        : (indirect string, offset: 0x4752f): GdkColor
    <757>   DW_AT_decl_file   : 24
    <758>   DW_AT_decl_line   : 102
    <759>   DW_AT_type        : <0x75d>
 <1><75d>: Abbrev Number: 9 (DW_TAG_structure_type)
    <75e>   DW_AT_name        : (indirect string, offset: 0x4752e): _GdkColor
    <762>   DW_AT_byte_size   : 12
    <763>   DW_AT_decl_file   : 25
    <764>   DW_AT_decl_line   : 46
    <765>   DW_AT_sibling     : <0x79a>
 <2><769>: Abbrev Number: 10 (DW_TAG_member)
    <76a>   DW_AT_name        : (indirect string, offset: 0x4e133): pixel
    <76e>   DW_AT_decl_file   : 25
    <76f>   DW_AT_decl_line   : 48
    <770>   DW_AT_type        : <0x9c>
    <774>   DW_AT_data_member_location: 0
 <2><775>: Abbrev Number: 11 (DW_TAG_member)
    <776>   DW_AT_name        : red
    <77a>   DW_AT_decl_file   : 25
    <77b>   DW_AT_decl_line   : 49
    <77c>   DW_AT_type        : <0x8a>
    <780>   DW_AT_data_member_location: 4
 <2><781>: Abbrev Number: 10 (DW_TAG_member)
    <782>   DW_AT_name        : (indirect string, offset: 0x300f7): green
    <786>   DW_AT_decl_file   : 25
    <787>   DW_AT_decl_line   : 50
    <788>   DW_AT_type        : <0x8a>
    <78c>   DW_AT_data_member_location: 6
 <2><78d>: Abbrev Number: 10 (DW_TAG_member)
    <78e>   DW_AT_name        : (indirect string, offset: 0x174cb): blue
    <792>   DW_AT_decl_file   : 25
    <793>   DW_AT_decl_line   : 51
    <794>   DW_AT_type        : <0x8a>
    <798>   DW_AT_data_member_location: 8
 <2><799>: Abbrev Number: 0
 <1><79a>: Abbrev Number: 3 (DW_TAG_typedef)
    <79b>   DW_AT_name        : (indirect string, offset: 0x3f6e2): GdkColormap
    <79f>   DW_AT_decl_file   : 24
    <7a0>   DW_AT_decl_line   : 103
    <7a1>   DW_AT_type        : <0x7a5>
 <1><7a5>: Abbrev Number: 9 (DW_TAG_structure_type)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x3f6e1): _GdkColormap
    <7aa>   DW_AT_byte_size   : 56
    <7ab>   DW_AT_decl_file   : 25
    <7ac>   DW_AT_decl_line   : 68
    <7ad>   DW_AT_sibling     : <0x7ee>
 <2><7b1>: Abbrev Number: 10 (DW_TAG_member)
    <7b2>   DW_AT_name        : (indirect string, offset: 0x5a6c5): parent_instance
    <7b6>   DW_AT_decl_file   : 25
    <7b7>   DW_AT_decl_line   : 71
    <7b8>   DW_AT_type        : <0x49d>
    <7bc>   DW_AT_data_member_location: 0
 <2><7bd>: Abbrev Number: 10 (DW_TAG_member)
    <7be>   DW_AT_name        : (indirect string, offset: 0x46524): size
    <7c2>   DW_AT_decl_file   : 25
    <7c3>   DW_AT_decl_line   : 74
    <7c4>   DW_AT_type        : <0xfb>
    <7c8>   DW_AT_data_member_location: 24
 <2><7c9>: Abbrev Number: 10 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0x46a7e): colors
    <7ce>   DW_AT_decl_file   : 25
    <7cf>   DW_AT_decl_line   : 75
    <7d0>   DW_AT_type        : <0xae5>
    <7d4>   DW_AT_data_member_location: 32
 <2><7d5>: Abbrev Number: 10 (DW_TAG_member)
    <7d6>   DW_AT_name        : (indirect string, offset: 0x2c18b): visual
    <7da>   DW_AT_decl_file   : 25
    <7db>   DW_AT_decl_line   : 78
    <7dc>   DW_AT_type        : <0xaeb>
    <7e0>   DW_AT_data_member_location: 40
 <2><7e1>: Abbrev Number: 10 (DW_TAG_member)
    <7e2>   DW_AT_name        : (indirect string, offset: 0x1f80f): windowing_data
    <7e6>   DW_AT_decl_file   : 25
    <7e7>   DW_AT_decl_line   : 80
    <7e8>   DW_AT_type        : <0x140>
    <7ec>   DW_AT_data_member_location: 48
 <2><7ed>: Abbrev Number: 0
 <1><7ee>: Abbrev Number: 3 (DW_TAG_typedef)
    <7ef>   DW_AT_name        : (indirect string, offset: 0x22925): GdkCursor
    <7f3>   DW_AT_decl_file   : 24
    <7f4>   DW_AT_decl_line   : 104
    <7f5>   DW_AT_type        : <0x7f9>
 <1><7f9>: Abbrev Number: 9 (DW_TAG_structure_type)
    <7fa>   DW_AT_name        : (indirect string, offset: 0x22924): _GdkCursor
    <7fe>   DW_AT_byte_size   : 8
    <7ff>   DW_AT_decl_file   : 26
    <800>   DW_AT_decl_line   : 127
    <801>   DW_AT_sibling     : <0x81e>
 <2><805>: Abbrev Number: 10 (DW_TAG_member)
    <806>   DW_AT_name        : (indirect string, offset: 0x40119): type
    <80a>   DW_AT_decl_file   : 26
    <80b>   DW_AT_decl_line   : 129
    <80c>   DW_AT_type        : <0xd43>
    <810>   DW_AT_data_member_location: 0
 <2><811>: Abbrev Number: 10 (DW_TAG_member)
    <812>   DW_AT_name        : (indirect string, offset: 0x1e714): ref_count
    <816>   DW_AT_decl_file   : 26
    <817>   DW_AT_decl_line   : 131
    <818>   DW_AT_type        : <0x111>
    <81c>   DW_AT_data_member_location: 4
 <2><81d>: Abbrev Number: 0
 <1><81e>: Abbrev Number: 3 (DW_TAG_typedef)
    <81f>   DW_AT_name        : (indirect string, offset: 0x1644c): GdkFont
    <823>   DW_AT_decl_file   : 24
    <824>   DW_AT_decl_line   : 105
    <825>   DW_AT_type        : <0x829>
 <1><829>: Abbrev Number: 9 (DW_TAG_structure_type)
    <82a>   DW_AT_name        : (indirect string, offset: 0x1644b): _GdkFont
    <82e>   DW_AT_byte_size   : 12
    <82f>   DW_AT_decl_file   : 27
    <830>   DW_AT_decl_line   : 49
    <831>   DW_AT_sibling     : <0x85a>
 <2><835>: Abbrev Number: 10 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0x40119): type
    <83a>   DW_AT_decl_file   : 27
    <83b>   DW_AT_decl_line   : 51
    <83c>   DW_AT_type        : <0xd79>
    <840>   DW_AT_data_member_location: 0
 <2><841>: Abbrev Number: 10 (DW_TAG_member)
    <842>   DW_AT_name        : (indirect string, offset: 0x5cddc): ascent
    <846>   DW_AT_decl_file   : 27
    <847>   DW_AT_decl_line   : 52
    <848>   DW_AT_type        : <0xfb>
    <84c>   DW_AT_data_member_location: 4
 <2><84d>: Abbrev Number: 10 (DW_TAG_member)
    <84e>   DW_AT_name        : (indirect string, offset: 0x5d510): descent
    <852>   DW_AT_decl_file   : 27
    <853>   DW_AT_decl_line   : 53
    <854>   DW_AT_type        : <0xfb>
    <858>   DW_AT_data_member_location: 8
 <2><859>: Abbrev Number: 0
 <1><85a>: Abbrev Number: 3 (DW_TAG_typedef)
    <85b>   DW_AT_name        : (indirect string, offset: 0x47a60): GdkGC
    <85f>   DW_AT_decl_file   : 24
    <860>   DW_AT_decl_line   : 106
    <861>   DW_AT_type        : <0x865>
 <1><865>: Abbrev Number: 9 (DW_TAG_structure_type)
    <866>   DW_AT_name        : (indirect string, offset: 0x47a5f): _GdkGC
    <86a>   DW_AT_byte_size   : 48
    <86b>   DW_AT_decl_file   : 28
    <86c>   DW_AT_decl_line   : 189
    <86d>   DW_AT_sibling     : <0x8ba>
 <2><871>: Abbrev Number: 10 (DW_TAG_member)
    <872>   DW_AT_name        : (indirect string, offset: 0x5a6c5): parent_instance
    <876>   DW_AT_decl_file   : 28
    <877>   DW_AT_decl_line   : 191
    <878>   DW_AT_type        : <0x49d>
    <87c>   DW_AT_data_member_location: 0
 <2><87d>: Abbrev Number: 10 (DW_TAG_member)
    <87e>   DW_AT_name        : (indirect string, offset: 0x43bc9): clip_x_origin
    <882>   DW_AT_decl_file   : 28
    <883>   DW_AT_decl_line   : 193
    <884>   DW_AT_type        : <0xfb>
    <888>   DW_AT_data_member_location: 24
 <2><889>: Abbrev Number: 10 (DW_TAG_member)
    <88a>   DW_AT_name        : (indirect string, offset: 0x19944): clip_y_origin
    <88e>   DW_AT_decl_file   : 28
    <88f>   DW_AT_decl_line   : 194
    <890>   DW_AT_type        : <0xfb>
    <894>   DW_AT_data_member_location: 28
 <2><895>: Abbrev Number: 10 (DW_TAG_member)
    <896>   DW_AT_name        : (indirect string, offset: 0xe827): ts_x_origin
    <89a>   DW_AT_decl_file   : 28
    <89b>   DW_AT_decl_line   : 195
    <89c>   DW_AT_type        : <0xfb>
    <8a0>   DW_AT_data_member_location: 32
 <2><8a1>: Abbrev Number: 10 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x4167d): ts_y_origin
    <8a6>   DW_AT_decl_file   : 28
    <8a7>   DW_AT_decl_line   : 196
    <8a8>   DW_AT_type        : <0xfb>
    <8ac>   DW_AT_data_member_location: 36
 <2><8ad>: Abbrev Number: 10 (DW_TAG_member)
    <8ae>   DW_AT_name        : (indirect string, offset: 0x38dbe): colormap
    <8b2>   DW_AT_decl_file   : 28
    <8b3>   DW_AT_decl_line   : 198
    <8b4>   DW_AT_type        : <0xd5a>
    <8b8>   DW_AT_data_member_location: 40
 <2><8b9>: Abbrev Number: 0
 <1><8ba>: Abbrev Number: 3 (DW_TAG_typedef)
    <8bb>   DW_AT_name        : (indirect string, offset: 0x55703): GdkVisual
    <8bf>   DW_AT_decl_file   : 24
    <8c0>   DW_AT_decl_line   : 109
    <8c1>   DW_AT_type        : <0x8c5>
 <1><8c5>: Abbrev Number: 9 (DW_TAG_structure_type)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x55702): _GdkVisual
    <8ca>   DW_AT_byte_size   : 80
    <8cb>   DW_AT_decl_file   : 29
    <8cc>   DW_AT_decl_line   : 77
    <8cd>   DW_AT_sibling     : <0x986>
 <2><8d1>: Abbrev Number: 10 (DW_TAG_member)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x5a6c5): parent_instance
    <8d6>   DW_AT_decl_file   : 29
    <8d7>   DW_AT_decl_line   : 79
    <8d8>   DW_AT_type        : <0x49d>
    <8dc>   DW_AT_data_member_location: 0
 <2><8dd>: Abbrev Number: 10 (DW_TAG_member)
    <8de>   DW_AT_name        : (indirect string, offset: 0x40119): type
    <8e2>   DW_AT_decl_file   : 29
    <8e3>   DW_AT_decl_line   : 81
    <8e4>   DW_AT_type        : <0xdbb>
    <8e8>   DW_AT_data_member_location: 24
 <2><8e9>: Abbrev Number: 10 (DW_TAG_member)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x299aa): depth
    <8ee>   DW_AT_decl_file   : 29
    <8ef>   DW_AT_decl_line   : 82
    <8f0>   DW_AT_type        : <0xfb>
    <8f4>   DW_AT_data_member_location: 28
 <2><8f5>: Abbrev Number: 10 (DW_TAG_member)
    <8f6>   DW_AT_name        : (indirect string, offset: 0xd360): byte_order
    <8fa>   DW_AT_decl_file   : 29
    <8fb>   DW_AT_decl_line   : 83
    <8fc>   DW_AT_type        : <0xa42>
    <900>   DW_AT_data_member_location: 32
 <2><901>: Abbrev Number: 10 (DW_TAG_member)
    <902>   DW_AT_name        : (indirect string, offset: 0x4a6f7): colormap_size
    <906>   DW_AT_decl_file   : 29
    <907>   DW_AT_decl_line   : 84
    <908>   DW_AT_type        : <0xfb>
    <90c>   DW_AT_data_member_location: 36
 <2><90d>: Abbrev Number: 10 (DW_TAG_member)
    <90e>   DW_AT_name        : (indirect string, offset: 0x54592): bits_per_rgb
    <912>   DW_AT_decl_file   : 29
    <913>   DW_AT_decl_line   : 85
    <914>   DW_AT_type        : <0xfb>
    <918>   DW_AT_data_member_location: 40
 <2><919>: Abbrev Number: 10 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0x1b1e3): red_mask
    <91e>   DW_AT_decl_file   : 29
    <91f>   DW_AT_decl_line   : 87
    <920>   DW_AT_type        : <0x9c>
    <924>   DW_AT_data_member_location: 44
 <2><925>: Abbrev Number: 10 (DW_TAG_member)
    <926>   DW_AT_name        : (indirect string, offset: 0x4fec6): red_shift
    <92a>   DW_AT_decl_file   : 29
    <92b>   DW_AT_decl_line   : 88
    <92c>   DW_AT_type        : <0xfb>
    <930>   DW_AT_data_member_location: 48
 <2><931>: Abbrev Number: 10 (DW_TAG_member)
    <932>   DW_AT_name        : (indirect string, offset: 0x5a5ce): red_prec
    <936>   DW_AT_decl_file   : 29
    <937>   DW_AT_decl_line   : 89
    <938>   DW_AT_type        : <0xfb>
    <93c>   DW_AT_data_member_location: 52
 <2><93d>: Abbrev Number: 10 (DW_TAG_member)
    <93e>   DW_AT_name        : (indirect string, offset: 0x4fda6): green_mask
    <942>   DW_AT_decl_file   : 29
    <943>   DW_AT_decl_line   : 91
    <944>   DW_AT_type        : <0x9c>
    <948>   DW_AT_data_member_location: 56
 <2><949>: Abbrev Number: 10 (DW_TAG_member)
    <94a>   DW_AT_name        : (indirect string, offset: 0x5b211): green_shift
    <94e>   DW_AT_decl_file   : 29
    <94f>   DW_AT_decl_line   : 92
    <950>   DW_AT_type        : <0xfb>
    <954>   DW_AT_data_member_location: 60
 <2><955>: Abbrev Number: 10 (DW_TAG_member)
    <956>   DW_AT_name        : (indirect string, offset: 0x32d1d): green_prec
    <95a>   DW_AT_decl_file   : 29
    <95b>   DW_AT_decl_line   : 93
    <95c>   DW_AT_type        : <0xfb>
    <960>   DW_AT_data_member_location: 64
 <2><961>: Abbrev Number: 10 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0x5d518): blue_mask
    <966>   DW_AT_decl_file   : 29
    <967>   DW_AT_decl_line   : 95
    <968>   DW_AT_type        : <0x9c>
    <96c>   DW_AT_data_member_location: 68
 <2><96d>: Abbrev Number: 10 (DW_TAG_member)
    <96e>   DW_AT_name        : (indirect string, offset: 0x11043): blue_shift
    <972>   DW_AT_decl_file   : 29
    <973>   DW_AT_decl_line   : 96
    <974>   DW_AT_type        : <0xfb>
    <978>   DW_AT_data_member_location: 72
 <2><979>: Abbrev Number: 10 (DW_TAG_member)
    <97a>   DW_AT_name        : (indirect string, offset: 0x4005b): blue_prec
    <97e>   DW_AT_decl_file   : 29
    <97f>   DW_AT_decl_line   : 97
    <980>   DW_AT_type        : <0xfb>
    <984>   DW_AT_data_member_location: 76
 <2><985>: Abbrev Number: 0
 <1><986>: Abbrev Number: 9 (DW_TAG_structure_type)
    <987>   DW_AT_name        : (indirect string, offset: 0x39f90): _GdkDrawable
    <98b>   DW_AT_byte_size   : 24
    <98c>   DW_AT_decl_file   : 30
    <98d>   DW_AT_decl_line   : 53
    <98e>   DW_AT_sibling     : <0x99f>
 <2><992>: Abbrev Number: 10 (DW_TAG_member)
    <993>   DW_AT_name        : (indirect string, offset: 0x5a6c5): parent_instance
    <997>   DW_AT_decl_file   : 30
    <998>   DW_AT_decl_line   : 55
    <999>   DW_AT_type        : <0x49d>
    <99d>   DW_AT_data_member_location: 0
 <2><99e>: Abbrev Number: 0
 <1><99f>: Abbrev Number: 3 (DW_TAG_typedef)
    <9a0>   DW_AT_name        : (indirect string, offset: 0x34a2d): GdkPixmap
    <9a4>   DW_AT_decl_file   : 24
    <9a5>   DW_AT_decl_line   : 113
    <9a6>   DW_AT_type        : <0x986>
 <1><9aa>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ab>   DW_AT_name        : (indirect string, offset: 0x4e83a): GdkWindow
    <9af>   DW_AT_decl_file   : 24
    <9b0>   DW_AT_decl_line   : 114
    <9b1>   DW_AT_type        : <0x986>
 <1><9b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x43cfa): GdkScreen
    <9ba>   DW_AT_decl_file   : 24
    <9bb>   DW_AT_decl_line   : 116
    <9bc>   DW_AT_type        : <0x9c0>
 <1><9c0>: Abbrev Number: 28 (DW_TAG_structure_type)
    <9c1>   DW_AT_name        : (indirect string, offset: 0x43cf9): _GdkScreen
    <9c5>   DW_AT_byte_size   : 816
    <9c7>   DW_AT_decl_file   : 31
    <9c8>   DW_AT_decl_line   : 46
    <9c9>   DW_AT_sibling     : <0xa29>
 <2><9cd>: Abbrev Number: 10 (DW_TAG_member)
    <9ce>   DW_AT_name        : (indirect string, offset: 0x5a6c5): parent_instance
    <9d2>   DW_AT_decl_file   : 31
    <9d3>   DW_AT_decl_line   : 48
    <9d4>   DW_AT_type        : <0x49d>
    <9d8>   DW_AT_data_member_location: 0
 <2><9d9>: Abbrev Number: 29 (DW_TAG_member)
    <9da>   DW_AT_name        : (indirect string, offset: 0x27bb0): closed
    <9de>   DW_AT_decl_file   : 31
    <9df>   DW_AT_decl_line   : 50
    <9e0>   DW_AT_type        : <0x111>
    <9e4>   DW_AT_byte_size   : 4
    <9e5>   DW_AT_bit_size    : 1
    <9e6>   DW_AT_bit_offset  : 31
    <9e7>   DW_AT_data_member_location: 24
 <2><9e8>: Abbrev Number: 10 (DW_TAG_member)
    <9e9>   DW_AT_name        : (indirect string, offset: 0x380c): normal_gcs
    <9ed>   DW_AT_decl_file   : 31
    <9ee>   DW_AT_decl_line   : 52
    <9ef>   DW_AT_type        : <0xb3a>
    <9f3>   DW_AT_data_member_location: 32
 <2><9f4>: Abbrev Number: 30 (DW_TAG_member)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x32fc7): exposure_gcs
    <9f9>   DW_AT_decl_file   : 31
    <9fa>   DW_AT_decl_line   : 53
    <9fb>   DW_AT_type        : <0xb3a>
    <9ff>   DW_AT_data_member_location: 288
 <2><a01>: Abbrev Number: 30 (DW_TAG_member)
    <a02>   DW_AT_name        : (indirect string, offset: 0x315f5): subwindow_gcs
    <a06>   DW_AT_decl_file   : 31
    <a07>   DW_AT_decl_line   : 54
    <a08>   DW_AT_type        : <0xb3a>
    <a0c>   DW_AT_data_member_location: 544
 <2><a0e>: Abbrev Number: 30 (DW_TAG_member)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x4728a): font_options
    <a13>   DW_AT_decl_file   : 31
    <a14>   DW_AT_decl_line   : 56
    <a15>   DW_AT_type        : <0xb50>
    <a19>   DW_AT_data_member_location: 800
 <2><a1b>: Abbrev Number: 30 (DW_TAG_member)
    <a1c>   DW_AT_name        : (indirect string, offset: 0x4e7f2): resolution
    <a20>   DW_AT_decl_file   : 31
    <a21>   DW_AT_decl_line   : 57
    <a22>   DW_AT_type        : <0x139>
    <a26>   DW_AT_data_member_location: 808
 <2><a28>: Abbrev Number: 0
 <1><a29>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <a2a>   DW_AT_byte_size   : 4
    <a2b>   DW_AT_type        : <0xa7>
    <a2f>   DW_AT_decl_file   : 24
    <a30>   DW_AT_decl_line   : 119
    <a31>   DW_AT_sibling     : <0xa42>
 <2><a35>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a36>   DW_AT_name        : (indirect string, offset: 0x440dc): GDK_LSB_FIRST
    <a3a>   DW_AT_const_value : 0
 <2><a3b>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a3c>   DW_AT_name        : (indirect string, offset: 0x2682f): GDK_MSB_FIRST
    <a40>   DW_AT_const_value : 1
 <2><a41>: Abbrev Number: 0
 <1><a42>: Abbrev Number: 3 (DW_TAG_typedef)
    <a43>   DW_AT_name        : (indirect string, offset: 0xbb39): GdkByteOrder
    <a47>   DW_AT_decl_file   : 24
    <a48>   DW_AT_decl_line   : 122
    <a49>   DW_AT_type        : <0xa29>
 <1><a4d>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <a4e>   DW_AT_byte_size   : 4
    <a4f>   DW_AT_type        : <0xa7>
    <a53>   DW_AT_decl_file   : 24
    <a54>   DW_AT_decl_line   : 127
    <a55>   DW_AT_sibling     : <0xada>
 <2><a59>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a5a>   DW_AT_name        : (indirect string, offset: 0x1b83c): GDK_SHIFT_MASK
    <a5e>   DW_AT_const_value : 1
 <2><a5f>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a60>   DW_AT_name        : (indirect string, offset: 0x4e198): GDK_LOCK_MASK
    <a64>   DW_AT_const_value : 2
 <2><a65>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a66>   DW_AT_name        : (indirect string, offset: 0x2e631): GDK_CONTROL_MASK
    <a6a>   DW_AT_const_value : 4
 <2><a6b>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a6c>   DW_AT_name        : (indirect string, offset: 0xdb73): GDK_MOD1_MASK
    <a70>   DW_AT_const_value : 8
 <2><a71>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0x1ed86): GDK_MOD2_MASK
    <a76>   DW_AT_const_value : 16
 <2><a77>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0x3061b): GDK_MOD3_MASK
    <a7c>   DW_AT_const_value : 32
 <2><a7d>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x42240): GDK_MOD4_MASK
    <a82>   DW_AT_const_value : 64
 <2><a83>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x521e4): GDK_MOD5_MASK
    <a88>   DW_AT_const_value : 128
 <2><a89>: Abbrev Number: 22 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x1a372): GDK_BUTTON1_MASK
    <a8e>   DW_AT_const_value : 256
 <2><a90>: Abbrev Number: 22 (DW_TAG_enumerator)
    <a91>   DW_AT_name        : (indirect string, offset: 0x2be3d): GDK_BUTTON2_MASK
    <a95>   DW_AT_const_value : 512
 <2><a97>: Abbrev Number: 22 (DW_TAG_enumerator)
    <a98>   DW_AT_name        : (indirect string, offset: 0x3c633): GDK_BUTTON3_MASK
    <a9c>   DW_AT_const_value : 1024
 <2><a9e>: Abbrev Number: 22 (DW_TAG_enumerator)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x4d4ec): GDK_BUTTON4_MASK
    <aa3>   DW_AT_const_value : 2048
 <2><aa5>: Abbrev Number: 22 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x1e24): GDK_BUTTON5_MASK
    <aaa>   DW_AT_const_value : 4096
 <2><aac>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aad>   DW_AT_name        : (indirect string, offset: 0x12752): GDK_SUPER_MASK
    <ab1>   DW_AT_const_value : 0x4000000
 <2><ab5>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x1b6b8): GDK_HYPER_MASK
    <aba>   DW_AT_const_value : 0x8000000
 <2><abe>: Abbrev Number: 26 (DW_TAG_enumerator)
    <abf>   DW_AT_name        : (indirect string, offset: 0x4185f): GDK_META_MASK
    <ac3>   DW_AT_const_value : 0x10000000
 <2><ac7>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ac8>   DW_AT_name        : (indirect string, offset: 0x4e72e): GDK_RELEASE_MASK
    <acc>   DW_AT_const_value : 0x40000000
 <2><ad0>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x1b65d): GDK_MODIFIER_MASK
    <ad5>   DW_AT_const_value : 0x5c001fff
 <2><ad9>: Abbrev Number: 0
 <1><ada>: Abbrev Number: 3 (DW_TAG_typedef)
    <adb>   DW_AT_name        : (indirect string, offset: 0x3380a): GdkModifierType
    <adf>   DW_AT_decl_file   : 24
    <ae0>   DW_AT_decl_line   : 153
    <ae1>   DW_AT_type        : <0xa4d>
 <1><ae5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ae6>   DW_AT_byte_size   : 8
    <ae7>   DW_AT_type        : <0x752>
 <1><aeb>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <aec>   DW_AT_byte_size   : 8
    <aed>   DW_AT_type        : <0x8ba>
 <1><af1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <af2>   DW_AT_byte_size   : 8
    <af3>   DW_AT_type        : <0x9aa>
 <1><af7>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <af8>   DW_AT_byte_size   : 4
    <af9>   DW_AT_type        : <0xa7>
    <afd>   DW_AT_decl_file   : 32
    <afe>   DW_AT_decl_line   : 74
    <aff>   DW_AT_sibling     : <0xb34>
 <2><b03>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b04>   DW_AT_name        : (indirect string, offset: 0x1818f): GDK_AXIS_IGNORE
    <b08>   DW_AT_const_value : 0
 <2><b09>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b0a>   DW_AT_name        : (indirect string, offset: 0x8c5c): GDK_AXIS_X
    <b0e>   DW_AT_const_value : 1
 <2><b0f>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b10>   DW_AT_name        : (indirect string, offset: 0x8c67): GDK_AXIS_Y
    <b14>   DW_AT_const_value : 2
 <2><b15>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b16>   DW_AT_name        : (indirect string, offset: 0x15082): GDK_AXIS_PRESSURE
    <b1a>   DW_AT_const_value : 3
 <2><b1b>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b1c>   DW_AT_name        : (indirect string, offset: 0x2db98): GDK_AXIS_XTILT
    <b20>   DW_AT_const_value : 4
 <2><b21>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b22>   DW_AT_name        : (indirect string, offset: 0x3bc6d): GDK_AXIS_YTILT
    <b26>   DW_AT_const_value : 5
 <2><b27>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b28>   DW_AT_name        : (indirect string, offset: 0x522d1): GDK_AXIS_WHEEL
    <b2c>   DW_AT_const_value : 6
 <2><b2d>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b2e>   DW_AT_name        : (indirect string, offset: 0x225b): GDK_AXIS_LAST
    <b32>   DW_AT_const_value : 7
 <2><b33>: Abbrev Number: 0
 <1><b34>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b35>   DW_AT_byte_size   : 8
    <b36>   DW_AT_type        : <0x9b5>
 <1><b3a>: Abbrev Number: 16 (DW_TAG_array_type)
    <b3b>   DW_AT_type        : <0xb4a>
    <b3f>   DW_AT_sibling     : <0xb4a>
 <2><b43>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <b44>   DW_AT_type        : <0xcf>
    <b48>   DW_AT_upper_bound : 31
 <2><b49>: Abbrev Number: 0
 <1><b4a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b4b>   DW_AT_byte_size   : 8
    <b4c>   DW_AT_type        : <0x85a>
 <1><b50>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b51>   DW_AT_byte_size   : 8
    <b52>   DW_AT_type        : <0x4ea>
 <1><b56>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <b57>   DW_AT_byte_size   : 4
    <b58>   DW_AT_type        : <0x4a>
    <b5c>   DW_AT_decl_file   : 26
    <b5d>   DW_AT_decl_line   : 44
    <b5e>   DW_AT_sibling     : <0xd43>
 <2><b62>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b63>   DW_AT_name        : (indirect string, offset: 0x5860a): GDK_X_CURSOR
    <b67>   DW_AT_const_value : 0
 <2><b68>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b69>   DW_AT_name        : (indirect string, offset: 0x2aa01): GDK_ARROW
    <b6d>   DW_AT_const_value : 2
 <2><b6e>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x6269): GDK_BASED_ARROW_DOWN
    <b73>   DW_AT_const_value : 4
 <2><b74>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b75>   DW_AT_name        : (indirect string, offset: 0x1eab6): GDK_BASED_ARROW_UP
    <b79>   DW_AT_const_value : 6
 <2><b7a>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x5488e): GDK_BOAT
    <b7f>   DW_AT_const_value : 8
 <2><b80>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b81>   DW_AT_name        : (indirect string, offset: 0x1eea9): GDK_BOGOSITY
    <b85>   DW_AT_const_value : 10
 <2><b86>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b87>   DW_AT_name        : (indirect string, offset: 0x2b488): GDK_BOTTOM_LEFT_CORNER
    <b8b>   DW_AT_const_value : 12
 <2><b8c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b8d>   DW_AT_name        : (indirect string, offset: 0x391fa): GDK_BOTTOM_RIGHT_CORNER
    <b91>   DW_AT_const_value : 14
 <2><b92>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b93>   DW_AT_name        : (indirect string, offset: 0x1cb3b): GDK_BOTTOM_SIDE
    <b97>   DW_AT_const_value : 16
 <2><b98>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b99>   DW_AT_name        : (indirect string, offset: 0x532d1): GDK_BOTTOM_TEE
    <b9d>   DW_AT_const_value : 18
 <2><b9e>: Abbrev Number: 21 (DW_TAG_enumerator)
    <b9f>   DW_AT_name        : (indirect string, offset: 0x3b5ca): GDK_BOX_SPIRAL
    <ba3>   DW_AT_const_value : 20
 <2><ba4>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x28750): GDK_CENTER_PTR
    <ba9>   DW_AT_const_value : 22
 <2><baa>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bab>   DW_AT_name        : (indirect string, offset: 0x59be6): GDK_CIRCLE
    <baf>   DW_AT_const_value : 24
 <2><bb0>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x43fc3): GDK_CLOCK
    <bb5>   DW_AT_const_value : 26
 <2><bb6>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bb7>   DW_AT_name        : (indirect string, offset: 0x553a1): GDK_COFFEE_MUG
    <bbb>   DW_AT_const_value : 28
 <2><bbc>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x5894a): GDK_CROSS
    <bc1>   DW_AT_const_value : 30
 <2><bc2>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bc3>   DW_AT_name        : (indirect string, offset: 0x46a23): GDK_CROSS_REVERSE
    <bc7>   DW_AT_const_value : 32
 <2><bc8>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bc9>   DW_AT_name        : (indirect string, offset: 0x2a1c2): GDK_CROSSHAIR
    <bcd>   DW_AT_const_value : 34
 <2><bce>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x46fd1): GDK_DIAMOND_CROSS
    <bd3>   DW_AT_const_value : 36
 <2><bd4>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x24246): GDK_DOT
    <bd9>   DW_AT_const_value : 38
 <2><bda>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x314cb): GDK_DOTBOX
    <bdf>   DW_AT_const_value : 40
 <2><be0>: Abbrev Number: 21 (DW_TAG_enumerator)
    <be1>   DW_AT_name        : (indirect string, offset: 0x588ce): GDK_DOUBLE_ARROW
    <be5>   DW_AT_const_value : 42
 <2><be6>: Abbrev Number: 21 (DW_TAG_enumerator)
    <be7>   DW_AT_name        : (indirect string, offset: 0x5367f): GDK_DRAFT_LARGE
    <beb>   DW_AT_const_value : 44
 <2><bec>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bed>   DW_AT_name        : (indirect string, offset: 0x3cf35): GDK_DRAFT_SMALL
    <bf1>   DW_AT_const_value : 46
 <2><bf2>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bf3>   DW_AT_name        : (indirect string, offset: 0x1603f): GDK_DRAPED_BOX
    <bf7>   DW_AT_const_value : 48
 <2><bf8>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x58c9d): GDK_EXCHANGE
    <bfd>   DW_AT_const_value : 50
 <2><bfe>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bff>   DW_AT_name        : (indirect string, offset: 0x30694): GDK_FLEUR
    <c03>   DW_AT_const_value : 52
 <2><c04>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c05>   DW_AT_name        : (indirect string, offset: 0x332c5): GDK_GOBBLER
    <c09>   DW_AT_const_value : 54
 <2><c0a>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x25f9): GDK_GUMBY
    <c0f>   DW_AT_const_value : 56
 <2><c10>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c11>   DW_AT_name        : (indirect string, offset: 0x177c9): GDK_HAND1
    <c15>   DW_AT_const_value : 58
 <2><c16>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c17>   DW_AT_name        : (indirect string, offset: 0x177d3): GDK_HAND2
    <c1b>   DW_AT_const_value : 60
 <2><c1c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c1d>   DW_AT_name        : (indirect string, offset: 0x1160d): GDK_HEART
    <c21>   DW_AT_const_value : 62
 <2><c22>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c23>   DW_AT_name        : (indirect string, offset: 0x12ef7): GDK_ICON
    <c27>   DW_AT_const_value : 64
 <2><c28>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c29>   DW_AT_name        : (indirect string, offset: 0x2f98c): GDK_IRON_CROSS
    <c2d>   DW_AT_const_value : 66
 <2><c2e>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x13239): GDK_LEFT_PTR
    <c33>   DW_AT_const_value : 68
 <2><c34>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c35>   DW_AT_name        : (indirect string, offset: 0x3e219): GDK_LEFT_SIDE
    <c39>   DW_AT_const_value : 70
 <2><c3a>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c3b>   DW_AT_name        : (indirect string, offset: 0x1660e): GDK_LEFT_TEE
    <c3f>   DW_AT_const_value : 72
 <2><c40>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c41>   DW_AT_name        : (indirect string, offset: 0xb4b2): GDK_LEFTBUTTON
    <c45>   DW_AT_const_value : 74
 <2><c46>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c47>   DW_AT_name        : (indirect string, offset: 0x27511): GDK_LL_ANGLE
    <c4b>   DW_AT_const_value : 76
 <2><c4c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x5b9a): GDK_LR_ANGLE
    <c51>   DW_AT_const_value : 78
 <2><c52>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c53>   DW_AT_name        : (indirect string, offset: 0x49ba9): GDK_MAN
    <c57>   DW_AT_const_value : 80
 <2><c58>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c59>   DW_AT_name        : (indirect string, offset: 0x9f7d): GDK_MIDDLEBUTTON
    <c5d>   DW_AT_const_value : 82
 <2><c5e>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c5f>   DW_AT_name        : (indirect string, offset: 0x3174): GDK_MOUSE
    <c63>   DW_AT_const_value : 84
 <2><c64>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c65>   DW_AT_name        : (indirect string, offset: 0x1e00f): GDK_PENCIL
    <c69>   DW_AT_const_value : 86
 <2><c6a>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c6b>   DW_AT_name        : (indirect string, offset: 0x50391): GDK_PIRATE
    <c6f>   DW_AT_const_value : 88
 <2><c70>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c71>   DW_AT_name        : (indirect string, offset: 0x14828): GDK_PLUS
    <c75>   DW_AT_const_value : 90
 <2><c76>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c77>   DW_AT_name        : (indirect string, offset: 0x209ac): GDK_QUESTION_ARROW
    <c7b>   DW_AT_const_value : 92
 <2><c7c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x4a758): GDK_RIGHT_PTR
    <c81>   DW_AT_const_value : 94
 <2><c82>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c83>   DW_AT_name        : (indirect string, offset: 0x19a12): GDK_RIGHT_SIDE
    <c87>   DW_AT_const_value : 96
 <2><c88>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c89>   DW_AT_name        : (indirect string, offset: 0x4d5d0): GDK_RIGHT_TEE
    <c8d>   DW_AT_const_value : 98
 <2><c8e>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c8f>   DW_AT_name        : (indirect string, offset: 0xb326): GDK_RIGHTBUTTON
    <c93>   DW_AT_const_value : 100
 <2><c94>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c95>   DW_AT_name        : (indirect string, offset: 0x43792): GDK_RTL_LOGO
    <c99>   DW_AT_const_value : 102
 <2><c9a>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x4b91a): GDK_SAILBOAT
    <c9f>   DW_AT_const_value : 104
 <2><ca0>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ca1>   DW_AT_name        : (indirect string, offset: 0x3520c): GDK_SB_DOWN_ARROW
    <ca5>   DW_AT_const_value : 106
 <2><ca6>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ca7>   DW_AT_name        : (indirect string, offset: 0x32c0f): GDK_SB_H_DOUBLE_ARROW
    <cab>   DW_AT_const_value : 108
 <2><cac>: Abbrev Number: 21 (DW_TAG_enumerator)
    <cad>   DW_AT_name        : (indirect string, offset: 0x20e54): GDK_SB_LEFT_ARROW
    <cb1>   DW_AT_const_value : 110
 <2><cb2>: Abbrev Number: 21 (DW_TAG_enumerator)
    <cb3>   DW_AT_name        : (indirect string, offset: 0xe8e8): GDK_SB_RIGHT_ARROW
    <cb7>   DW_AT_const_value : 112
 <2><cb8>: Abbrev Number: 21 (DW_TAG_enumerator)
    <cb9>   DW_AT_name        : (indirect string, offset: 0x6a48): GDK_SB_UP_ARROW
    <cbd>   DW_AT_const_value : 114
 <2><cbe>: Abbrev Number: 21 (DW_TAG_enumerator)
    <cbf>   DW_AT_name        : (indirect string, offset: 0x54696): GDK_SB_V_DOUBLE_ARROW
    <cc3>   DW_AT_const_value : 116
 <2><cc4>: Abbrev Number: 21 (DW_TAG_enumerator)
    <cc5>   DW_AT_name        : (indirect string, offset: 0xd41f): GDK_SHUTTLE
    <cc9>   DW_AT_const_value : 118
 <2><cca>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x2ca8c): GDK_SIZING
    <ccf>   DW_AT_const_value : 120
 <2><cd0>: Abbrev Number: 21 (DW_TAG_enumerator)
    <cd1>   DW_AT_name        : (indirect string, offset: 0x278): GDK_SPIDER
    <cd5>   DW_AT_const_value : 122
 <2><cd6>: Abbrev Number: 21 (DW_TAG_enumerator)
    <cd7>   DW_AT_name        : (indirect string, offset: 0x28193): GDK_SPRAYCAN
    <cdb>   DW_AT_const_value : 124
 <2><cdc>: Abbrev Number: 21 (DW_TAG_enumerator)
    <cdd>   DW_AT_name        : (indirect string, offset: 0x2656f): GDK_STAR
    <ce1>   DW_AT_const_value : 126
 <2><ce2>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x5b329): GDK_TARGET
    <ce7>   DW_AT_const_value : 128
 <2><ce8>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x31997): GDK_TCROSS
    <ced>   DW_AT_const_value : 130
 <2><cee>: Abbrev Number: 21 (DW_TAG_enumerator)
    <cef>   DW_AT_name        : (indirect string, offset: 0x59118): GDK_TOP_LEFT_ARROW
    <cf3>   DW_AT_const_value : 132
 <2><cf4>: Abbrev Number: 21 (DW_TAG_enumerator)
    <cf5>   DW_AT_name        : (indirect string, offset: 0x21239): GDK_TOP_LEFT_CORNER
    <cf9>   DW_AT_const_value : 134
 <2><cfa>: Abbrev Number: 21 (DW_TAG_enumerator)
    <cfb>   DW_AT_name        : (indirect string, offset: 0x51964): GDK_TOP_RIGHT_CORNER
    <cff>   DW_AT_const_value : 136
 <2><d00>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d01>   DW_AT_name        : (indirect string, offset: 0x14d0f): GDK_TOP_SIDE
    <d05>   DW_AT_const_value : 138
 <2><d06>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d07>   DW_AT_name        : (indirect string, offset: 0x4816): GDK_TOP_TEE
    <d0b>   DW_AT_const_value : 140
 <2><d0c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d0d>   DW_AT_name        : (indirect string, offset: 0x16442): GDK_TREK
    <d11>   DW_AT_const_value : 142
 <2><d12>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d13>   DW_AT_name        : (indirect string, offset: 0x20c9c): GDK_UL_ANGLE
    <d17>   DW_AT_const_value : 144
 <2><d18>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d19>   DW_AT_name        : (indirect string, offset: 0xa659): GDK_UMBRELLA
    <d1d>   DW_AT_const_value : 146
 <2><d1e>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d1f>   DW_AT_name        : (indirect string, offset: 0x5d004): GDK_UR_ANGLE
    <d23>   DW_AT_const_value : 148
 <2><d24>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d25>   DW_AT_name        : (indirect string, offset: 0xfdcd): GDK_WATCH
    <d29>   DW_AT_const_value : 150
 <2><d2a>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d2b>   DW_AT_name        : (indirect string, offset: 0xb628): GDK_XTERM
    <d2f>   DW_AT_const_value : 152
 <2><d30>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d31>   DW_AT_name        : (indirect string, offset: 0x567e7): GDK_LAST_CURSOR
    <d35>   DW_AT_const_value : 153
 <2><d36>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d37>   DW_AT_name        : (indirect string, offset: 0x3100a): GDK_BLANK_CURSOR
    <d3b>   DW_AT_const_value : -2
 <2><d3c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <d3d>   DW_AT_name        : (indirect string, offset: 0x31a13): GDK_CURSOR_IS_PIXMAP
    <d41>   DW_AT_const_value : -1
 <2><d42>: Abbrev Number: 0
 <1><d43>: Abbrev Number: 3 (DW_TAG_typedef)
    <d44>   DW_AT_name        : (indirect string, offset: 0xf16d): GdkCursorType
    <d48>   DW_AT_decl_file   : 26
    <d49>   DW_AT_decl_line   : 125
    <d4a>   DW_AT_type        : <0xb56>
 <1><d4e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d4f>   DW_AT_byte_size   : 8
    <d50>   DW_AT_type        : <0x81e>
 <1><d54>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d55>   DW_AT_byte_size   : 8
    <d56>   DW_AT_type        : <0x99f>
 <1><d5a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d5b>   DW_AT_byte_size   : 8
    <d5c>   DW_AT_type        : <0x79a>
 <1><d60>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <d61>   DW_AT_byte_size   : 4
    <d62>   DW_AT_type        : <0xa7>
    <d66>   DW_AT_decl_file   : 27
    <d67>   DW_AT_decl_line   : 44
    <d68>   DW_AT_sibling     : <0xd79>
 <2><d6c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x34f0f): GDK_FONT_FONT
    <d71>   DW_AT_const_value : 0
 <2><d72>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d73>   DW_AT_name        : (indirect string, offset: 0x3d464): GDK_FONT_FONTSET
    <d77>   DW_AT_const_value : 1
 <2><d78>: Abbrev Number: 0
 <1><d79>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7a>   DW_AT_name        : (indirect string, offset: 0x4fbab): GdkFontType
    <d7e>   DW_AT_decl_file   : 27
    <d7f>   DW_AT_decl_line   : 47
    <d80>   DW_AT_type        : <0xd60>
 <1><d84>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d85>   DW_AT_byte_size   : 8
    <d86>   DW_AT_type        : <0x7ee>
 <1><d8a>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <d8b>   DW_AT_byte_size   : 4
    <d8c>   DW_AT_type        : <0xa7>
    <d90>   DW_AT_decl_file   : 29
    <d91>   DW_AT_decl_line   : 56
    <d92>   DW_AT_sibling     : <0xdbb>
 <2><d96>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d97>   DW_AT_name        : (indirect string, offset: 0x5cf45): GDK_VISUAL_STATIC_GRAY
    <d9b>   DW_AT_const_value : 0
 <2><d9c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <d9d>   DW_AT_name        : (indirect string, offset: 0x1590b): GDK_VISUAL_GRAYSCALE
    <da1>   DW_AT_const_value : 1
 <2><da2>: Abbrev Number: 21 (DW_TAG_enumerator)
    <da3>   DW_AT_name        : (indirect string, offset: 0x554ee): GDK_VISUAL_STATIC_COLOR
    <da7>   DW_AT_const_value : 2
 <2><da8>: Abbrev Number: 21 (DW_TAG_enumerator)
    <da9>   DW_AT_name        : (indirect string, offset: 0x2ca4): GDK_VISUAL_PSEUDO_COLOR
    <dad>   DW_AT_const_value : 3
 <2><dae>: Abbrev Number: 21 (DW_TAG_enumerator)
    <daf>   DW_AT_name        : (indirect string, offset: 0x41df0): GDK_VISUAL_TRUE_COLOR
    <db3>   DW_AT_const_value : 4
 <2><db4>: Abbrev Number: 21 (DW_TAG_enumerator)
    <db5>   DW_AT_name        : (indirect string, offset: 0x114ea): GDK_VISUAL_DIRECT_COLOR
    <db9>   DW_AT_const_value : 5
 <2><dba>: Abbrev Number: 0
 <1><dbb>: Abbrev Number: 3 (DW_TAG_typedef)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x4ac38): GdkVisualType
    <dc0>   DW_AT_decl_file   : 29
    <dc1>   DW_AT_decl_line   : 63
    <dc2>   DW_AT_type        : <0xd8a>
 <1><dc6>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <dc7>   DW_AT_byte_size   : 4
    <dc8>   DW_AT_type        : <0xa7>
    <dcc>   DW_AT_decl_file   : 33
    <dcd>   DW_AT_decl_line   : 182
    <dce>   DW_AT_sibling     : <0xdeb>
 <2><dd2>: Abbrev Number: 21 (DW_TAG_enumerator)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x2537f): GTK_JUSTIFY_LEFT
    <dd7>   DW_AT_const_value : 0
 <2><dd8>: Abbrev Number: 21 (DW_TAG_enumerator)
    <dd9>   DW_AT_name        : (indirect string, offset: 0xac03): GTK_JUSTIFY_RIGHT
    <ddd>   DW_AT_const_value : 1
 <2><dde>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x5b905): GTK_JUSTIFY_CENTER
    <de3>   DW_AT_const_value : 2
 <2><de4>: Abbrev Number: 21 (DW_TAG_enumerator)
    <de5>   DW_AT_name        : (indirect string, offset: 0x215f8): GTK_JUSTIFY_FILL
    <de9>   DW_AT_const_value : 3
 <2><dea>: Abbrev Number: 0
 <1><deb>: Abbrev Number: 3 (DW_TAG_typedef)
    <dec>   DW_AT_name        : (indirect string, offset: 0x299b0): GtkJustification
    <df0>   DW_AT_decl_file   : 33
    <df1>   DW_AT_decl_line   : 187
    <df2>   DW_AT_type        : <0xdc6>
 <1><df6>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <df7>   DW_AT_byte_size   : 4
    <df8>   DW_AT_type        : <0xa7>
    <dfc>   DW_AT_decl_file   : 33
    <dfd>   DW_AT_decl_line   : 306
    <dff>   DW_AT_sibling     : <0xe16>
 <2><e03>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e04>   DW_AT_name        : (indirect string, offset: 0x1b724): GTK_POLICY_ALWAYS
    <e08>   DW_AT_const_value : 0
 <2><e09>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x3bc7c): GTK_POLICY_AUTOMATIC
    <e0e>   DW_AT_const_value : 1
 <2><e0f>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e10>   DW_AT_name        : (indirect string, offset: 0x42efa): GTK_POLICY_NEVER
    <e14>   DW_AT_const_value : 2
 <2><e15>: Abbrev Number: 0
 <1><e16>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <e17>   DW_AT_byte_size   : 4
    <e18>   DW_AT_type        : <0xa7>
    <e1c>   DW_AT_decl_file   : 33
    <e1d>   DW_AT_decl_line   : 380
    <e1f>   DW_AT_sibling     : <0xe42>
 <2><e23>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e24>   DW_AT_name        : (indirect string, offset: 0x1f8d1): GTK_SELECTION_NONE
    <e28>   DW_AT_const_value : 0
 <2><e29>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e2a>   DW_AT_name        : (indirect string, offset: 0x55407): GTK_SELECTION_SINGLE
    <e2e>   DW_AT_const_value : 1
 <2><e2f>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e30>   DW_AT_name        : (indirect string, offset: 0x53b22): GTK_SELECTION_BROWSE
    <e34>   DW_AT_const_value : 2
 <2><e35>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e36>   DW_AT_name        : (indirect string, offset: 0x3e640): GTK_SELECTION_MULTIPLE
    <e3a>   DW_AT_const_value : 3
 <2><e3b>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x1baa3): GTK_SELECTION_EXTENDED
    <e40>   DW_AT_const_value : 3
 <2><e41>: Abbrev Number: 0
 <1><e42>: Abbrev Number: 23 (DW_TAG_typedef)
    <e43>   DW_AT_name        : (indirect string, offset: 0x395e4): GtkSelectionMode
    <e47>   DW_AT_decl_file   : 33
    <e48>   DW_AT_decl_line   : 386
    <e4a>   DW_AT_type        : <0xe16>
 <1><e4e>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <e4f>   DW_AT_byte_size   : 4
    <e50>   DW_AT_type        : <0xa7>
    <e54>   DW_AT_decl_file   : 33
    <e55>   DW_AT_decl_line   : 390
    <e57>   DW_AT_sibling     : <0xe7a>
 <2><e5b>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e5c>   DW_AT_name        : (indirect string, offset: 0x49100): GTK_SHADOW_NONE
    <e60>   DW_AT_const_value : 0
 <2><e61>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e62>   DW_AT_name        : (indirect string, offset: 0x4593f): GTK_SHADOW_IN
    <e66>   DW_AT_const_value : 1
 <2><e67>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e68>   DW_AT_name        : (indirect string, offset: 0x16171): GTK_SHADOW_OUT
    <e6c>   DW_AT_const_value : 2
 <2><e6d>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x3267e): GTK_SHADOW_ETCHED_IN
    <e72>   DW_AT_const_value : 3
 <2><e73>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e74>   DW_AT_name        : (indirect string, offset: 0x2aa85): GTK_SHADOW_ETCHED_OUT
    <e78>   DW_AT_const_value : 4
 <2><e79>: Abbrev Number: 0
 <1><e7a>: Abbrev Number: 23 (DW_TAG_typedef)
    <e7b>   DW_AT_name        : (indirect string, offset: 0x2b6e0): GtkShadowType
    <e7f>   DW_AT_decl_file   : 33
    <e80>   DW_AT_decl_line   : 396
    <e82>   DW_AT_type        : <0xe4e>
 <1><e86>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <e87>   DW_AT_byte_size   : 4
    <e88>   DW_AT_type        : <0xa7>
    <e8c>   DW_AT_decl_file   : 33
    <e8d>   DW_AT_decl_line   : 400
    <e8f>   DW_AT_sibling     : <0xeb2>
 <2><e93>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e94>   DW_AT_name        : (indirect string, offset: 0x1a4b4): GTK_STATE_NORMAL
    <e98>   DW_AT_const_value : 0
 <2><e99>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x460ad): GTK_STATE_ACTIVE
    <e9e>   DW_AT_const_value : 1
 <2><e9f>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ea0>   DW_AT_name        : (indirect string, offset: 0x31b89): GTK_STATE_PRELIGHT
    <ea4>   DW_AT_const_value : 2
 <2><ea5>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x52f8): GTK_STATE_SELECTED
    <eaa>   DW_AT_const_value : 3
 <2><eab>: Abbrev Number: 21 (DW_TAG_enumerator)
    <eac>   DW_AT_name        : (indirect string, offset: 0x1faf5): GTK_STATE_INSENSITIVE
    <eb0>   DW_AT_const_value : 4
 <2><eb1>: Abbrev Number: 0
 <1><eb2>: Abbrev Number: 23 (DW_TAG_typedef)
    <eb3>   DW_AT_name        : (indirect string, offset: 0x3e699): GtkStateType
    <eb7>   DW_AT_decl_file   : 33
    <eb8>   DW_AT_decl_line   : 406
    <eba>   DW_AT_type        : <0xe86>
 <1><ebe>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <ebf>   DW_AT_byte_size   : 4
    <ec0>   DW_AT_type        : <0xa7>
    <ec4>   DW_AT_decl_file   : 33
    <ec5>   DW_AT_decl_line   : 461
    <ec7>   DW_AT_sibling     : <0xed8>
 <2><ecb>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ecc>   DW_AT_name        : (indirect string, offset: 0x10168): GTK_WINDOW_TOPLEVEL
    <ed0>   DW_AT_const_value : 0
 <2><ed1>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ed2>   DW_AT_name        : (indirect string, offset: 0x36f): GTK_WINDOW_POPUP
    <ed6>   DW_AT_const_value : 1
 <2><ed7>: Abbrev Number: 0
 <1><ed8>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <ed9>   DW_AT_byte_size   : 4
    <eda>   DW_AT_type        : <0xa7>
    <ede>   DW_AT_decl_file   : 33
    <edf>   DW_AT_decl_line   : 477
    <ee1>   DW_AT_sibling     : <0xef2>
 <2><ee5>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ee6>   DW_AT_name        : (indirect string, offset: 0xb313): GTK_SORT_ASCENDING
    <eea>   DW_AT_const_value : 0
 <2><eeb>: Abbrev Number: 21 (DW_TAG_enumerator)
    <eec>   DW_AT_name        : (indirect string, offset: 0x2d7b): GTK_SORT_DESCENDING
    <ef0>   DW_AT_const_value : 1
 <2><ef1>: Abbrev Number: 0
 <1><ef2>: Abbrev Number: 23 (DW_TAG_typedef)
    <ef3>   DW_AT_name        : (indirect string, offset: 0x1a8b2): GtkSortType
    <ef7>   DW_AT_decl_file   : 33
    <ef8>   DW_AT_decl_line   : 480
    <efa>   DW_AT_type        : <0xed8>
 <1><efe>: Abbrev Number: 3 (DW_TAG_typedef)
    <eff>   DW_AT_name        : (indirect string, offset: 0x421a5): GtkObject
    <f03>   DW_AT_decl_file   : 34
    <f04>   DW_AT_decl_line   : 49
    <f05>   DW_AT_type        : <0xf09>
 <1><f09>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f0a>   DW_AT_name        : (indirect string, offset: 0x421a4): _GtkObject
    <f0e>   DW_AT_byte_size   : 32
    <f0f>   DW_AT_decl_file   : 35
    <f10>   DW_AT_decl_line   : 107
    <f11>   DW_AT_sibling     : <0xf2e>
 <2><f15>: Abbrev Number: 10 (DW_TAG_member)
    <f16>   DW_AT_name        : (indirect string, offset: 0x5a6c5): parent_instance
    <f1a>   DW_AT_decl_file   : 35
    <f1b>   DW_AT_decl_line   : 109
    <f1c>   DW_AT_type        : <0x4d9>
    <f20>   DW_AT_data_member_location: 0
 <2><f21>: Abbrev Number: 10 (DW_TAG_member)
    <f22>   DW_AT_name        : (indirect string, offset: 0x52099): flags
    <f26>   DW_AT_decl_file   : 35
    <f27>   DW_AT_decl_line   : 116
    <f28>   DW_AT_type        : <0x9c>
    <f2c>   DW_AT_data_member_location: 24
 <2><f2d>: Abbrev Number: 0
 <1><f2e>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2f>   DW_AT_name        : (indirect string, offset: 0x27440): GtkSignalFunc
    <f33>   DW_AT_decl_file   : 34
    <f34>   DW_AT_decl_line   : 127
    <f35>   DW_AT_type        : <0x1b0>
 <1><f39>: Abbrev Number: 3 (DW_TAG_typedef)
    <f3a>   DW_AT_name        : (indirect string, offset: 0x140d0): GtkAdjustment
    <f3e>   DW_AT_decl_file   : 36
    <f3f>   DW_AT_decl_line   : 48
    <f40>   DW_AT_type        : <0xf44>
 <1><f44>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f45>   DW_AT_name        : (indirect string, offset: 0x140cf): _GtkAdjustment
    <f49>   DW_AT_byte_size   : 80
    <f4a>   DW_AT_decl_file   : 36
    <f4b>   DW_AT_decl_line   : 51
    <f4c>   DW_AT_sibling     : <0xfa5>
 <2><f50>: Abbrev Number: 10 (DW_TAG_member)
    <f51>   DW_AT_name        : (indirect string, offset: 0x5a6c5): parent_instance
    <f55>   DW_AT_decl_file   : 36
    <f56>   DW_AT_decl_line   : 53
    <f57>   DW_AT_type        : <0xefe>
    <f5b>   DW_AT_data_member_location: 0
 <2><f5c>: Abbrev Number: 10 (DW_TAG_member)
    <f5d>   DW_AT_name        : (indirect string, offset: 0x4deb9): lower
    <f61>   DW_AT_decl_file   : 36
    <f62>   DW_AT_decl_line   : 55
    <f63>   DW_AT_type        : <0x12e>
    <f67>   DW_AT_data_member_location: 32
 <2><f68>: Abbrev Number: 10 (DW_TAG_member)
    <f69>   DW_AT_name        : (indirect string, offset: 0x4d9a6): upper
    <f6d>   DW_AT_decl_file   : 36
    <f6e>   DW_AT_decl_line   : 56
    <f6f>   DW_AT_type        : <0x12e>
    <f73>   DW_AT_data_member_location: 40
 <2><f74>: Abbrev Number: 10 (DW_TAG_member)
    <f75>   DW_AT_name        : (indirect string, offset: 0x18673): value
    <f79>   DW_AT_decl_file   : 36
    <f7a>   DW_AT_decl_line   : 57
    <f7b>   DW_AT_type        : <0x12e>
    <f7f>   DW_AT_data_member_location: 48
 <2><f80>: Abbrev Number: 10 (DW_TAG_member)
    <f81>   DW_AT_name        : (indirect string, offset: 0x516f9): step_increment
    <f85>   DW_AT_decl_file   : 36
    <f86>   DW_AT_decl_line   : 58
    <f87>   DW_AT_type        : <0x12e>
    <f8b>   DW_AT_data_member_location: 56
 <2><f8c>: Abbrev Number: 10 (DW_TAG_member)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x58213): page_increment
    <f91>   DW_AT_decl_file   : 36
    <f92>   DW_AT_decl_line   : 59
    <f93>   DW_AT_type        : <0x12e>
    <f97>   DW_AT_data_member_location: 64
 <2><f98>: Abbrev Number: 10 (DW_TAG_member)
    <f99>   DW_AT_name        : (indirect string, offset: 0x4651f): page_size
    <f9d>   DW_AT_decl_file   : 36
    <f9e>   DW_AT_decl_line   : 60
    <f9f>   DW_AT_type        : <0x12e>
    <fa3>   DW_AT_data_member_location: 72
 <2><fa4>: Abbrev Number: 0
 <1><fa5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <fa6>   DW_AT_byte_size   : 8
    <fa7>   DW_AT_type        : <0xf39>
 <1><fab>: Abbrev Number: 3 (DW_TAG_typedef)
    <fac>   DW_AT_name        : (indirect string, offset: 0x389ee): GtkStyle
    <fb0>   DW_AT_decl_file   : 37
    <fb1>   DW_AT_decl_line   : 54
    <fb2>   DW_AT_type        : <0xfb6>
 <1><fb6>: Abbrev Number: 28 (DW_TAG_structure_type)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x389ed): _GtkStyle
    <fbb>   DW_AT_byte_size   : 984
    <fbd>   DW_AT_decl_file   : 37
    <fbe>   DW_AT_decl_line   : 73
    <fbf>   DW_AT_sibling     : <0x1177>
 <2><fc3>: Abbrev Number: 10 (DW_TAG_member)
    <fc4>   DW_AT_name        : (indirect string, offset: 0x5a6c5): parent_instance
    <fc8>   DW_AT_decl_file   : 37
    <fc9>   DW_AT_decl_line   : 75
    <fca>   DW_AT_type        : <0x49d>
    <fce>   DW_AT_data_member_location: 0
 <2><fcf>: Abbrev Number: 11 (DW_TAG_member)
    <fd0>   DW_AT_name        : fg
    <fd3>   DW_AT_decl_file   : 37
    <fd4>   DW_AT_decl_line   : 79
    <fd5>   DW_AT_type        : <0x12e7>
    <fd9>   DW_AT_data_member_location: 24
 <2><fda>: Abbrev Number: 11 (DW_TAG_member)
    <fdb>   DW_AT_name        : bg
    <fde>   DW_AT_decl_file   : 37
    <fdf>   DW_AT_decl_line   : 80
    <fe0>   DW_AT_type        : <0x12e7>
    <fe4>   DW_AT_data_member_location: 84
 <2><fe5>: Abbrev Number: 10 (DW_TAG_member)
    <fe6>   DW_AT_name        : (indirect string, offset: 0x37047): light
    <fea>   DW_AT_decl_file   : 37
    <feb>   DW_AT_decl_line   : 81
    <fec>   DW_AT_type        : <0x12e7>
    <ff0>   DW_AT_data_member_location: 144
 <2><ff1>: Abbrev Number: 10 (DW_TAG_member)
    <ff2>   DW_AT_name        : (indirect string, offset: 0x57682): dark
    <ff6>   DW_AT_decl_file   : 37
    <ff7>   DW_AT_decl_line   : 82
    <ff8>   DW_AT_type        : <0x12e7>
    <ffc>   DW_AT_data_member_location: 204
 <2><ffd>: Abbrev Number: 32 (DW_TAG_member)
    <ffe>   DW_AT_name        : mid
    <1002>   DW_AT_decl_file   : 37
    <1003>   DW_AT_decl_line   : 83
    <1004>   DW_AT_type        : <0x12e7>
    <1008>   DW_AT_data_member_location: 264
 <2><100a>: Abbrev Number: 30 (DW_TAG_member)
    <100b>   DW_AT_name        : (indirect string, offset: 0x49ca2): text
    <100f>   DW_AT_decl_file   : 37
    <1010>   DW_AT_decl_line   : 84
    <1011>   DW_AT_type        : <0x12e7>
    <1015>   DW_AT_data_member_location: 324
 <2><1017>: Abbrev Number: 30 (DW_TAG_member)
    <1018>   DW_AT_name        : (indirect string, offset: 0x29af6): base
    <101c>   DW_AT_decl_file   : 37
    <101d>   DW_AT_decl_line   : 85
    <101e>   DW_AT_type        : <0x12e7>
    <1022>   DW_AT_data_member_location: 384
 <2><1024>: Abbrev Number: 30 (DW_TAG_member)
    <1025>   DW_AT_name        : (indirect string, offset: 0x1707b): text_aa
    <1029>   DW_AT_decl_file   : 37
    <102a>   DW_AT_decl_line   : 86
    <102b>   DW_AT_type        : <0x12e7>
    <102f>   DW_AT_data_member_location: 444
 <2><1031>: Abbrev Number: 30 (DW_TAG_member)
    <1032>   DW_AT_name        : (indirect string, offset: 0x2d6a5): black
    <1036>   DW_AT_decl_file   : 37
    <1037>   DW_AT_decl_line   : 88
    <1038>   DW_AT_type        : <0x752>
    <103c>   DW_AT_data_member_location: 504
 <2><103e>: Abbrev Number: 30 (DW_TAG_member)
    <103f>   DW_AT_name        : (indirect string, offset: 0x2dca6): white
    <1043>   DW_AT_decl_file   : 37
    <1044>   DW_AT_decl_line   : 89
    <1045>   DW_AT_type        : <0x752>
    <1049>   DW_AT_data_member_location: 516
 <2><104b>: Abbrev Number: 30 (DW_TAG_member)
    <104c>   DW_AT_name        : (indirect string, offset: 0x2d543): font_desc
    <1050>   DW_AT_decl_file   : 37
    <1051>   DW_AT_decl_line   : 90
    <1052>   DW_AT_type        : <0x50b>
    <1056>   DW_AT_data_member_location: 528
 <2><1058>: Abbrev Number: 30 (DW_TAG_member)
    <1059>   DW_AT_name        : (indirect string, offset: 0x14f23): xthickness
    <105d>   DW_AT_decl_file   : 37
    <105e>   DW_AT_decl_line   : 92
    <105f>   DW_AT_type        : <0xfb>
    <1063>   DW_AT_data_member_location: 536
 <2><1065>: Abbrev Number: 30 (DW_TAG_member)
    <1066>   DW_AT_name        : (indirect string, offset: 0x928): ythickness
    <106a>   DW_AT_decl_file   : 37
    <106b>   DW_AT_decl_line   : 93
    <106c>   DW_AT_type        : <0xfb>
    <1070>   DW_AT_data_member_location: 540
 <2><1072>: Abbrev Number: 30 (DW_TAG_member)
    <1073>   DW_AT_name        : (indirect string, offset: 0x46bdc): fg_gc
    <1077>   DW_AT_decl_file   : 37
    <1078>   DW_AT_decl_line   : 95
    <1079>   DW_AT_type        : <0x12f7>
    <107d>   DW_AT_data_member_location: 544
 <2><107f>: Abbrev Number: 30 (DW_TAG_member)
    <1080>   DW_AT_name        : (indirect string, offset: 0xde60): bg_gc
    <1084>   DW_AT_decl_file   : 37
    <1085>   DW_AT_decl_line   : 96
    <1086>   DW_AT_type        : <0x12f7>
    <108a>   DW_AT_data_member_location: 584
 <2><108c>: Abbrev Number: 30 (DW_TAG_member)
    <108d>   DW_AT_name        : (indirect string, offset: 0x3a4a4): light_gc
    <1091>   DW_AT_decl_file   : 37
    <1092>   DW_AT_decl_line   : 97
    <1093>   DW_AT_type        : <0x12f7>
    <1097>   DW_AT_data_member_location: 624
 <2><1099>: Abbrev Number: 30 (DW_TAG_member)
    <109a>   DW_AT_name        : (indirect string, offset: 0x1d73b): dark_gc
    <109e>   DW_AT_decl_file   : 37
    <109f>   DW_AT_decl_line   : 98
    <10a0>   DW_AT_type        : <0x12f7>
    <10a4>   DW_AT_data_member_location: 664
 <2><10a6>: Abbrev Number: 30 (DW_TAG_member)
    <10a7>   DW_AT_name        : (indirect string, offset: 0x245ee): mid_gc
    <10ab>   DW_AT_decl_file   : 37
    <10ac>   DW_AT_decl_line   : 99
    <10ad>   DW_AT_type        : <0x12f7>
    <10b1>   DW_AT_data_member_location: 704
 <2><10b3>: Abbrev Number: 30 (DW_TAG_member)
    <10b4>   DW_AT_name        : (indirect string, offset: 0x1983c): text_gc
    <10b8>   DW_AT_decl_file   : 37
    <10b9>   DW_AT_decl_line   : 100
    <10ba>   DW_AT_type        : <0x12f7>
    <10be>   DW_AT_data_member_location: 744
 <2><10c0>: Abbrev Number: 30 (DW_TAG_member)
    <10c1>   DW_AT_name        : (indirect string, offset: 0x274e1): base_gc
    <10c5>   DW_AT_decl_file   : 37
    <10c6>   DW_AT_decl_line   : 101
    <10c7>   DW_AT_type        : <0x12f7>
    <10cb>   DW_AT_data_member_location: 784
 <2><10cd>: Abbrev Number: 30 (DW_TAG_member)
    <10ce>   DW_AT_name        : (indirect string, offset: 0x49e27): text_aa_gc
    <10d2>   DW_AT_decl_file   : 37
    <10d3>   DW_AT_decl_line   : 102
    <10d4>   DW_AT_type        : <0x12f7>
    <10d8>   DW_AT_data_member_location: 824
 <2><10da>: Abbrev Number: 30 (DW_TAG_member)
    <10db>   DW_AT_name        : (indirect string, offset: 0x2132a): black_gc
    <10df>   DW_AT_decl_file   : 37
    <10e0>   DW_AT_decl_line   : 103
    <10e1>   DW_AT_type        : <0xb4a>
    <10e5>   DW_AT_data_member_location: 864
 <2><10e7>: Abbrev Number: 30 (DW_TAG_member)
    <10e8>   DW_AT_name        : (indirect string, offset: 0x5cabe): white_gc
    <10ec>   DW_AT_decl_file   : 37
    <10ed>   DW_AT_decl_line   : 104
    <10ee>   DW_AT_type        : <0xb4a>
    <10f2>   DW_AT_data_member_location: 872
 <2><10f4>: Abbrev Number: 30 (DW_TAG_member)
